SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430.h
*\*\author Nations
*\*\version v1.0.1
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/ 
#ifndef __N32G430_H__
#define __N32G430_H__

#ifdef __cplusplus
extern "C" {
#endif


/***  N32G430_Library_Basic ***/

#if !defined USE_STDPERIPH_DRIVER
/** Comment the line below if you will not use the peripherals drivers.
   In this case, these drivers will not be included and the application code will
   be based on direct access to peripherals registers **/
#define USE_STDPERIPH_DRIVER
#endif

/** In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.  **/
#if !defined HSE_VALUE
#define HSE_VALUE (8000000) /* Value of the External oscillator in Hz */
#endif                      /* HSE_VALUE */

/** In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value **/
#define HSE_STARTUP_TIMEOUT ((uint16_t)0x2000) /* SYSCLK= 128M Time out for HSE start up */
#define HSI_STARTUP_TIMEOUT ((uint16_t)0x0500) /* SYSCLK= 128M Time out for HSI start up */
#define LSE_STARTUP_TIMEOUT ((uint32_t)0x600000) /* SYSCLK= 128M Time out for LSE start up */
#define LSI_STARTUP_TIMEOUT ((uint16_t)0x0500) /* SYSCLK= 128M Time out for LSI start up */

#define HSI_VALUE (8000000) /* Value of the Internal oscillator in Hz */

#define __N32G430_STDPERIPH_VERSION_MAIN (0x00) /* [31:24] main version */
#define __N32G430_STDPERIPH_VERSION_SUB1 (0x04) /* [23:16] sub1 version */
#define __N32G430_STDPERIPH_VERSION_SUB2 (0x00) /* [15:8]  sub2 version */
#define __N32G430_STDPERIPH_VERSION_RC   (0x00) /* [7:0]  release candidate */

/** N32G430 Standard Peripheral Library version number **/
#define __N32G430_STDPERIPH_VERSION                                                                                    \
    ((__N32G430_STDPERIPH_VERSION_MAIN << 24) | (__N32G430_STDPERIPH_VERSION_SUB1 << 16)                               \
     | (__N32G430_STDPERIPH_VERSION_SUB2 << 8) | (__N32G430_STDPERIPH_VERSION_RC))

/** Configuration of the Cortex-M4 Processor and Core Peripherals **/
#ifdef N32G430
#define __MPU_PRESENT 1          /* N32G430 devices does not provide an MPU */
#define __FPU_PRESENT 1          /* FPU present */
#endif                           /* N32G430 */
#define __NVIC_PRIO_BITS       4 /* N32G430 uses 4 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig 0 /* Set to 1 if different SysTick Config is used */


/*** N32G430 Interrupt Number Definition ***/

typedef enum IRQn
{
    /** Cortex-M4 Processor Exceptions Numbers **/
    NMI_IRQn              = -14, /* 2 Non Maskable Interrupt                             */
    HardFault_IRQn        = -13, /* 3 Hard Fault Interrupt                               */
    MemoryManagement_IRQn = -12, /* 4 Cortex-M4 Memory Management Interrupt              */
    BusFault_IRQn         = -11, /* 5 Cortex-M4 Bus Fault Interrupt                      */
    UsageFault_IRQn       = -10, /* 6 Cortex-M4 Usage Fault Interrupt                    */
    SVCall_IRQn           = -5,  /* 11 Cortex-M4 SV Call Interrupt                       */
    DebugMonitor_IRQn     = -4,  /* 12 Cortex-M4 Debug Monitor Interrupt                 */
    PendSV_IRQn           = -2,  /* 14 Cortex-M4 Pend SV Interrupt                       */
    SysTick_IRQn          = -1,  /* 15 Cortex-M4 System Tick Interrupt                   */

    /** N32G430 specific Interrupt Numbers  **/
    WWDG_IRQn             = 0,  /* Window WatchDog Interrupt                            */
    PVD_IRQn              = 1,  /* PVD through EXTI Line16 detection interrupt          */
    RTC_TAMPER_STAMP_IRQn = 2,  /* EXTI Line18 interrupt                                */
    RTC_WKUP_IRQn         = 3,  /* RTC global Interrupt                                 */
    FLASH_IRQn            = 4,  /* FLASH global Interrupt                               */
    RCC_IRQn              = 5,  /* RCC global Interrupt                                 */
    EXTI0_IRQn            = 6,  /* EXTI Line0 Interrupt                                 */
    EXTI1_IRQn            = 7,  /* EXTI Line1 Interrupt                                 */
    EXTI2_IRQn            = 8,  /* EXTI Line2 Interrupt                                 */
    EXTI3_IRQn            = 9,  /* EXTI Line3 Interrupt                                 */
    EXTI4_IRQn            = 10, /* EXTI Line4 Interrupt                                 */
    
    DMA_Channel1_IRQn    = 11, /* DMA Channel 1 global Interrupt                      */
    DMA_Channel2_IRQn    = 12, /* DMA Channel 2 global Interrupt                      */
    DMA_Channel3_IRQn    = 13, /* DMA Channel 3 global Interrupt                      */
    DMA_Channel4_IRQn    = 14, /* DMA Channel 4 global Interrupt                      */
    DMA_Channel5_IRQn    = 15, /* DMA Channel 5 global Interrupt                      */
    DMA_Channel6_IRQn    = 16, /* DMA Channel 6 global Interrupt                      */
    DMA_Channel7_IRQn    = 17, /* DMA Channel 7 global Interrupt                      */
    DMA_Channel8_IRQn    = 18, /* DMA Channel 8 global Interrupt                      */    
    ADC_IRQn             = 19, /* UADC global interrupt                               */
    MMU_IRQn             = 20, /* MMU global interrupt                                */
    COMP_1_2_3_IRQn      = 21, /* COMP1 & COMP2 & COMP3 global Interrupt              */
    EXTI9_5_IRQn         = 22, /* External Line[9:5] Interrupts                       */
    
    TIM1_BRK_IRQn        = 23, /* TIM1 Break Interrupt                                 */
    TIM1_UP_IRQn         = 24, /* TIM1 Update Interrupt                                */
    TIM1_TRG_COM_IRQn    = 25, /* TIM1 Trigger and Commutation Interrupt               */
    TIM1_CC_IRQn         = 26, /* TIM1 Capture Compare Interrupt                       */
    TIM2_IRQn            = 27, /* TIM2 global Interrupt                                */
    TIM3_IRQn            = 28, /* TIM3 global Interrupt                                */
    TIM4_IRQn            = 29, /* TIM4 global Interrupt                                */    
    I2C1_EV_IRQn         = 30, /* I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn         = 31, /* I2C1 Error Interrupt                                 */
    I2C2_EV_IRQn         = 32, /* I2C2 Event Interrupt                                 */
    I2C2_ER_IRQn         = 33, /* I2C2 Error Interrupt                                 */
    SPI1_IRQn            = 34, /* SPI1 global Interrupt                                */
    SPI2_IRQn            = 35, /* SPI2 global Interrupt                                */
    USART1_IRQn          = 36, /* USART1 global Interrupt                              */
    USART2_IRQn          = 37, /* USART2 global Interrupt                              */
    UART3_IRQn           = 38, /* UART3 global Interrupt                               */
    EXTI15_10_IRQn       = 39, /* External Line[15:10] Interrupts                      */
    RTCAlarm_IRQn        = 40, /* RTC Alarm through EXTI Line Interrupt                */   
    LPTIM_WKUP_IRQn      = 41, /* LPTIM_WKUP through EXTI line 20 interrupt            */
    TIM8_BRK_IRQn        = 42, /* TIM8 Break Interrupt                                 */
    TIM8_UP_IRQn         = 43, /* TIM8 Update Interrupt                                */
    TIM8_TRG_COM_IRQn    = 44, /* TIM8 Trigger and Commutation Interrupt               */
    TIM8_CC_IRQn         = 45, /* TIM8 Capture Compare Interrupt                       */    
    UART4_IRQn           = 46, /* UART4 global Interrupt                               */
    TIM5_IRQn            = 47, /* TIM5 global Interrupt                                */
    TIM6_IRQn            = 48, /* TIM6 global Interrupt                                */  
    CAN_TX_IRQn          = 49, /* CAN TX Interrupt                                     */
    CAN_RX0_IRQn         = 50, /* CAN RX0 Interrupt                                    */
    CAN_RX1_IRQn         = 51, /* CAN RX1 Interrupt                                    */
    CAN_SCE_IRQn         = 52, /* CAN SCE Interrupt                                    */

} IRQn_Type;

#include "core_cm4.h"
#include "system_n32g430.h"
#include <stdint.h>
#include <stdbool.h>

typedef int32_t s32;
typedef int16_t s16;
typedef int8_t s8;

typedef const int32_t sc32; /* Read Only */
typedef const int16_t sc16; /* Read Only */
typedef const int8_t sc8;   /* Read Only */

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

