SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/*** Inter Integrated Circuit Interface ***/

typedef struct
{
    __IO uint16_t CTRL1;
    uint16_t RESERVED0;
    __IO uint16_t CTRL2;
    uint16_t RESERVED1;
    __IO uint16_t OADDR1;
    uint16_t RESERVED2;
    __IO uint16_t OADDR2;
    uint16_t RESERVED3;
    __IO uint16_t DAT;
    uint16_t RESERVED4;
    __IO uint16_t STS1;
    uint16_t RESERVED5;
    __IO uint16_t STS2;
    uint16_t RESERVED6;
    __IO uint16_t CLKCTRL;
    uint16_t RESERVED7;
    __IO uint32_t TMRISE;
} I2C_Module;


/*** Independent WATCHDOG ***/

typedef struct
{
    __IO uint32_t KEY;
    __IO uint32_t PREDIV; 
    __IO uint32_t RELV;
    __IO uint32_t STS;
} IWDG_Module;


/*** Power Controller ***/
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t CTRLSTS;
    __IO uint32_t CTRL2;
} PWR_Module;


/*** Low-Power Timer ***/

typedef struct
{
    __IO uint32_t INTSTS;
    __IO uint32_t INTCLR;
    __IO uint32_t INTEN;  
    __IO uint32_t CFG;
    __IO uint32_t CTRL;
    __IO uint32_t COMPx;
    __IO uint32_t ARR;
    __IO uint32_t CNT;
    __IO uint32_t OPT;  
} LPTIM_Module;

/*** Reset and Clock Control ***/

typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t CFG;
    __IO uint32_t CLKINT;
    __IO uint32_t APB2PRST;
    __IO uint32_t APB1PRST;
    __IO uint32_t AHBPCLKEN;
    __IO uint32_t APB2PCLKEN;
    __IO uint32_t APB1PCLKEN;
    __IO uint32_t BDCTRL;
    __IO uint32_t CTRLSTS;
    __IO uint32_t AHBPRST;
    __IO uint32_t CFG2;
    __IO uint32_t Reserve;
    __IO uint32_t RDCTRL;
    __IO uint32_t Reserve0;
    __IO uint32_t Reserve1; 
    __IO uint32_t PLLHSIPRE;
	__IO uint32_t Reserve2;
    __IO uint32_t Reserve3; 
	__IO uint32_t Reserve4;
    __IO uint32_t Reserve5; 
	__IO uint32_t Reserve6;
    __IO uint32_t Reserve7; 
	__IO uint32_t Reserve8;
    __IO uint32_t Reserve9; 
	__IO uint32_t Reserve10;
    __IO uint32_t Reserve11; 
	__IO uint32_t Reserve12;
    __IO uint32_t Reserve13; 
	__IO uint32_t Reserve14;
    __IO uint32_t Reserve15; 
	__IO uint32_t Reserve16;
    __IO uint32_t AHB1CLKEN;
} RCC_Module;


/*** Real-Time Clock ***/

typedef struct
{
    __IO uint32_t TSH;         /* RTC time register,                        Address offset: 0x00 */
    __IO uint32_t DATE;        /* RTC date register,                        Address offset: 0x04 */
    __IO uint32_t CTRL;        /* RTC control register,                     Address offset: 0x08 */
    __IO uint32_t INITSTS;     /* RTC initialization and status register,   Address offset: 0x0C */
    __IO uint32_t PRE;         /* RTC prescaler register,                   Address offset: 0x10 */
    __IO uint32_t WKUPT;       /* RTC wakeup timer register,                Address offset: 0x14 */
    uint32_t reserved0;        /* Reserved */
    __IO uint32_t ALARMA;      /* RTC alarm A register,                     Address offset: 0x1C */
    __IO uint32_t ALARMB;      /* RTC alarm B register,                     Address offset: 0x20 */
    __IO uint32_t WRP;         /* RTC write protection register,            Address offset: 0x24 */
    __IO uint32_t SUBS;        /* RTC sub second register,                  Address offset: 0x28 */
    __IO uint32_t SCTRL;       /* RTC shift control register,               Address offset: 0x2C */
    __IO uint32_t TST;         /* RTC time stamp time register,             Address offset: 0x30 */
    __IO uint32_t TSD;         /* RTC time stamp date register,             Address offset: 0x34 */
    __IO uint32_t TSSS;        /* RTC time-stamp sub second register,       Address offset: 0x38 */
    __IO uint32_t CALIB;       /* RTC calibration register,                 Address offset: 0x3C */
    __IO uint32_t TMPCFG;      /* RTC tamper configuration register,        Address offset: 0x40 */
    __IO uint32_t ALRMASS;     /* RTC alarm A sub second register,          Address offset: 0x44 */
    __IO uint32_t ALRMBSS;     /* RTC alarm B sub second register,          Address offset: 0x48 */
    __IO uint32_t OPT;         /* RTC option register,                      Address offset: 0x4C */
    __IO uint32_t BKP1R;       /* RTC backup register 1,                    Address offset: 0x50 */
    __IO uint32_t BKP2R;       /* RTC backup register 2,                    Address offset: 0x54 */
    __IO uint32_t BKP3R;       /* RTC backup register 3,                    Address offset: 0x58 */
    __IO uint32_t BKP4R;       /* RTC backup register 4,                    Address offset: 0x5C */
    __IO uint32_t BKP5R;       /* RTC backup register 5,                    Address offset: 0x60 */
    __IO uint32_t BKP6R;       /* RTC backup register 6,                    Address offset: 0x64 */
    __IO uint32_t BKP7R;       /* RTC backup register 7,                    Address offset: 0x68 */
    __IO uint32_t BKP8R;       /* RTC backup register 8,                    Address offset: 0x6C */
    __IO uint32_t BKP9R;       /* RTC backup register 9,                    Address offset: 0x70 */
    __IO uint32_t BKP10R;      /* RTC backup register 10,                   Address offset: 0x74 */
    __IO uint32_t BKP11R;      /* RTC backup register 11,                   Address offset: 0x78 */
    __IO uint32_t BKP12R;      /* RTC backup register 12,                   Address offset: 0x7C */
    __IO uint32_t BKP13R;      /* RTC backup register 13,                   Address offset: 0x80 */
    __IO uint32_t BKP14R;      /* RTC backup register 14,                   Address offset: 0x84 */
    __IO uint32_t BKP15R;      /* RTC backup register 15,                   Address offset: 0x88 */
    __IO uint32_t BKP16R;      /* RTC backup register 16,                   Address offset: 0x8C */
    __IO uint32_t BKP17R;      /* RTC backup register 17,                   Address offset: 0x90 */
    __IO uint32_t BKP18R;      /* RTC backup register 18,                   Address offset: 0x94 */
    __IO uint32_t BKP19R;      /* RTC backup register 19,                   Address offset: 0x98 */
    __IO uint32_t BKP20R;      /* RTC backup register 20,                   Address offset: 0x9C */
} RTC_Module;


