SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
#define DBG ((DBG_Module*)DBG_BASE)


/**** Peripheral Registers_Bits_Definition ****/


/*** CRC calculation unit ***/

/** Bit definition for CRC_CRC32DAT register **/
#define CRC32_DAT_DAT ((uint32_t)0xFFFFFFFF) /* Data register bits */

/** Bit definition for CRC_CRC32IDAT registerr **/
#define CRC32_IDAT_IDAT ((uint8_t)0xFF) /* General-purpose 8-bit data register bits */

/** Bit definition for CRC_CRC32CTRL register **/
#define CRC32_CTRL_RESET ((uint8_t)0x01) /* RESET bit */

/** Bit definition for CRC_CRC16CTRL register **/
#define CRC16_CTRL_LITTLE   ((uint8_t)0x02)
#define CRC16_CTRL_BIG      ((uint8_t)0xFD)

#define CRC16_CTRL_RESET    ((uint8_t)0x04)
#define CRC16_CTRL_NO_RESET ((uint8_t)0xFB)


/*** Power Controller ***/
/** Bit definition for PWR_CTRL register **/
#define PWR_CTRL_LPS        ((uint16_t)0x0001) /* Low-Power Deepsleep */
#define PWR_CTRL_PDS        ((uint16_t)0x0002) /* Power Down Deepsleep */
#define PWR_CTRL_CSBVBAT    ((uint16_t)0x0008) /* Clear Standby Flag */
#define PWR_CTRL_PVDEN      ((uint16_t)0x0010) /* Power Voltage Detector Enable */

#define PWR_CTRL_PLS        ((uint16_t)0x00E0) /* PLS[2:0] bits (PVD Level Selection) */
#define PWR_CTRL_PLS_0      ((uint16_t)0x0020) /* Bit 0 */
#define PWR_CTRL_PLS_1      ((uint16_t)0x0040) /* Bit 1 */
#define PWR_CTRL_PLS_2      ((uint16_t)0x0080) /* Bit 2 */

#define PWR_CTRL_PLS_2V2    ((uint16_t)0x0000) /* PVD level 2.2V */
#define PWR_CTRL_PLS_2V3    ((uint16_t)0x0020) /* PVD level 2.3V */
#define PWR_CTRL_PLS_2V4    ((uint16_t)0x0040) /* PVD level 2.4V */
#define PWR_CTRL_PLS_2V5    ((uint16_t)0x0060) /* PVD level 2.5V */
#define PWR_CTRL_PLS_2V6    ((uint16_t)0x0080) /* PVD level 2.6V */
#define PWR_CTRL_PLS_2V7    ((uint16_t)0x00A0) /* PVD level 2.7V */
#define PWR_CTRL_PLS_2V8    ((uint16_t)0x00C0) /* PVD level 2.8V */
#define PWR_CTRL_PLS_2V9    ((uint16_t)0x00E0) /* PVD level 2.9V */

#define PWR_CTRL_DBKP       ((uint16_t)0x0100) /* Disable Backup Domain write protection */
#define PWR_CTRL_MSB        ((uint16_t)0x0200) /* Bit 9 */
#define PWR_CTRL_CLRWKUP1   ((uint16_t)0x0400) /* Clear PA8 wakeup Flag */
#define PWR_CTRL_CLRWKUP2   ((uint16_t)0x0800) /* Clear PA0 wakeup Flag */
#define PWR_CTRL_CLRWKUP3   ((uint16_t)0x1000) /* Clear PC13 wakeup Flag */
#define PWR_CTRL_CLRRTCWKUP ((uint16_t)0x2000) /* Clear Standby Flag */

/** Bit definition for PWR_CTRLSTS register **/
#define PWR_CTRLSTS_STBYF     ((uint16_t)0x0002) /* Standby Flag */
#define PWR_CTRLSTS_PVDO      ((uint16_t)0x0004) /* PVD Output */
#define PWR_CTRLSTS_WKUPF1    ((uint16_t)0x0008) /* PA8 wakeup Flag */
#define PWR_CTRLSTS_WKUPF2    ((uint16_t)0x0010) /* PA0 wakeup Flag */
#define PWR_CTRLSTS_WKUPF3    ((uint16_t)0x0020) /* PC13 wakeup Flag */
#define PWR_CTRLSTS_WKUPRTCF  ((uint16_t)0x0040) /* RTC wakeup Flag */
#define PWR_CTRLSTS_WKUP1EN   ((uint16_t)0x0100) /* Enable PA8_WKUP pin */
#define PWR_CTRLSTS_WKUP2EN   ((uint16_t)0x0200) /* Enable PA0_WKUP pin */
#define PWR_CTRLSTS_WKUP3EN   ((uint16_t)0x0400) /* Enable PC13_WKUP pin */
#define PWR_CTRLSTS_WKUPRTCEN ((uint16_t)0x0800) /* Enable RTC wakeup */
#define PWR_CTRLSTS_WKUP1PS   ((uint16_t)0x1000) /* Wakeup polarity for PA8 */
#define PWR_CTRLSTS_WKUP2PS   ((uint16_t)0x2000) /* Wakeup polarity for PA0 */
#define PWR_CTRLSTS_WKUP3PS   ((uint16_t)0x4000) /* Wakeup polarity for PC13 */

/** Bit definition for PWR_CTRL2 register **/
#define PWR_CTRL2_STOP2S    ((uint16_t)0x0001) /* Enable STOP2 */
#define PWR_CTRL2_SRSTBRET  ((uint16_t)0x0004) /* SRAM standby mode retention  */
#define PWR_CTRL2_LSITRIM   ((uint16_t)0x01F0) /* config the LSI trimming value */
#define PWR_CTRL2_IWDGRSTEN ((uint16_t)0x0400) /* Enable IWDG RST WakeUp */


/*** Reset and Clock Control ***/

/** Bit definition for RCC_CTRL register **/
#define RCC_CTRL_HSIEN   ((uint32_t)0x00000001) /* Internal High Speed clock enable */
#define RCC_CTRL_HSIRDF  ((uint32_t)0x00000002) /* Internal High Speed clock ready flag */
#define RCC_CTRL_HSITRIM ((uint32_t)0x000000F8) /* Internal High Speed clock trimming */
#define RCC_CTRL_HSICAL  ((uint32_t)0x0000FF00) /* Internal High Speed clock Calibration */
#define RCC_CTRL_HSEEN   ((uint32_t)0x00010000) /* External High Speed clock enable */
#define RCC_CTRL_HSERDF  ((uint32_t)0x00020000) /* External High Speed clock ready flag */
#define RCC_CTRL_HSEBP   ((uint32_t)0x00040000) /* External High Speed clock Bypass */
#define RCC_CTRL_CLKSSEN ((uint32_t)0x00080000) /* Clock Security System enable */
#define RCC_CTRL_PLLEN   ((uint32_t)0x01000000) /* PLL enable */
#define RCC_CTRL_PLLRDF  ((uint32_t)0x02000000) /* PLL clock ready flag */

/** Bit definition for RCC_CFG register **/

/** SCLKSW configuration **/
#define RCC_CFG_SCLKSW   ((uint32_t)0x00000003) /* SCLKSW[1:0] bits (System clock Switch) */
#define RCC_CFG_SCLKSW_0 ((uint32_t)0x00000001) /* Bit 0 */
#define RCC_CFG_SCLKSW_1 ((uint32_t)0x00000002) /* Bit 1 */

#define RCC_CFG_SCLKSW_HSI ((uint32_t)0x00000000) /* HSI selected as system clock */
#define RCC_CFG_SCLKSW_HSE ((uint32_t)0x00000001) /* HSE selected as system clock */
#define RCC_CFG_SCLKSW_PLL ((uint32_t)0x00000002) /* PLL selected as system clock */

/** SCLKSTS configuration */
#define RCC_CFG_SCLKSTS   ((uint32_t)0x0000000C) /* SCLKSTS[1:0] bits (System Clock Switch Status) */
#define RCC_CFG_SCLKSTS_0 ((uint32_t)0x00000004) /* Bit 0 */
#define RCC_CFG_SCLKSTS_1 ((uint32_t)0x00000008) /* Bit 1 */

#define RCC_CFG_SCLKSTS_HSI ((uint32_t)0x00000000) /* HSI oscillator used as system clock */
#define RCC_CFG_SCLKSTS_HSE ((uint32_t)0x00000004) /* HSE oscillator used as system clock */
#define RCC_CFG_SCLKSTS_PLL ((uint32_t)0x00000008) /* PLL used as system clock */

/** AHBPRES configuration */
#define RCC_CFG_AHBPRES   ((uint32_t)0x000000F0) /* AHBPRES[3:0] bits (AHB prescaler) */
#define RCC_CFG_AHBPRES_0 ((uint32_t)0x00000010) /* Bit 0 */
#define RCC_CFG_AHBPRES_1 ((uint32_t)0x00000020) /* Bit 1 */
#define RCC_CFG_AHBPRES_2 ((uint32_t)0x00000040) /* Bit 2 */
#define RCC_CFG_AHBPRES_3 ((uint32_t)0x00000080) /* Bit 3 */

