SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for DMA_CHCFG1 register **/
#define DMA_CHCFG1_CHEN      ((uint16_t)0x0001) /* Channel enable*/
#define DMA_CHCFG1_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG1_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG1_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG1_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG1_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG1_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG1_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG1_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG1_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG1_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG1_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG1_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG1_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG1_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits(Channel Priority level) */
#define DMA_CHCFG1_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG1_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG1_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode */

/** Bit definition for DMA_CHCFG2 register **/
#define DMA_CHCFG2_CHEN      ((uint16_t)0x0001) /* Channel enable */
#define DMA_CHCFG2_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG2_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG2_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG2_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG2_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG2_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG2_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG2_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG2_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG2_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG2_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG2_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG2_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG2_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG2_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG2_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG2_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode */

/** Bit definition for DMA_CHCFG3 register **/
#define DMA_CHCFG3_CHEN      ((uint16_t)0x0001) /* Channel enable */
#define DMA_CHCFG3_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG3_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG3_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG3_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG3_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG3_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG3_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG3_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG3_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG3_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG3_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG3_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG3_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG3_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG3_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG3_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG3_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode */

/** Bit definition for DMA_CHCFG4 register **/
#define DMA_CHCFG4_CHEN      ((uint16_t)0x0001) /* Channel enable */
#define DMA_CHCFG4_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG4_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG4_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG4_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG4_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG4_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG4_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG4_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG4_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG4_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG4_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG4_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG4_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG4_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG4_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG4_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG4_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode */

/** Bit definition for DMA_CHCFG5 register **/
#define DMA_CHCFG5_CHEN      ((uint16_t)0x0001) /* Channel enable */
#define DMA_CHCFG5_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG5_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG5_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG5_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG5_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG5_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG5_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG5_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG5_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG5_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG5_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG5_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG5_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG5_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG5_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG5_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG5_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode enable */

