SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for DMA_CHCFG6 register **/
#define DMA_CHCFG6_CHEN      ((uint16_t)0x0001) /* Channel enable */
#define DMA_CHCFG6_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG6_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG6_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG6_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG6_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG6_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG6_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG6_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG6_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG6_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG6_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG6_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG6_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG6_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG6_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG6_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG6_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode */

/** Bit definition for DMA_CHCFG7 register **/
#define DMA_CHCFG7_CHEN      ((uint16_t)0x0001) /* Channel enable */
#define DMA_CHCFG7_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG7_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG7_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG7_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG7_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG7_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG7_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG7_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG7_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG7_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG7_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG7_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG7_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG7_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG7_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG7_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG7_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode enable */

/** Bit definition for DMA_CHCFG8 register **/
#define DMA_CHCFG8_CHEN      ((uint16_t)0x0001) /* Channel enable */
#define DMA_CHCFG8_TXCIE     ((uint16_t)0x0002) /* Transfer complete interrupt enable */
#define DMA_CHCFG8_HTXIE     ((uint16_t)0x0004) /* Half Transfer interrupt enable */
#define DMA_CHCFG8_ERRIE     ((uint16_t)0x0008) /* Transfer error interrupt enable */
#define DMA_CHCFG8_DIR       ((uint16_t)0x0010) /* Data transfer direction */
#define DMA_CHCFG8_CIRC      ((uint16_t)0x0020) /* Circular mode */
#define DMA_CHCFG8_PINC      ((uint16_t)0x0040) /* Peripheral increment mode */
#define DMA_CHCFG8_MINC      ((uint16_t)0x0080) /* Memory increment mode */

#define DMA_CHCFG8_PSIZE     ((uint16_t)0x0300) /* PSIZE[1:0] bits (Peripheral size) */
#define DMA_CHCFG8_PSIZE_0   ((uint16_t)0x0100) /* Bit 0 */
#define DMA_CHCFG8_PSIZE_1   ((uint16_t)0x0200) /* Bit 1 */

#define DMA_CHCFG8_MSIZE     ((uint16_t)0x0C00) /* MSIZE[1:0] bits (Memory size) */
#define DMA_CHCFG8_MSIZE_0   ((uint16_t)0x0400) /* Bit 0 */
#define DMA_CHCFG8_MSIZE_1   ((uint16_t)0x0800) /* Bit 1 */

#define DMA_CHCFG8_PRIOLVL   ((uint16_t)0x3000) /* PL[1:0] bits (Channel Priority level) */
#define DMA_CHCFG8_PRIOLVL_0 ((uint16_t)0x1000) /* Bit 0 */
#define DMA_CHCFG8_PRIOLVL_1 ((uint16_t)0x2000) /* Bit 1 */

#define DMA_CHCFG8_MEM2MEM   ((uint16_t)0x4000) /* Memory to memory mode enable */

/** Bit definition for DMA_TXNUM1 register **/
#define DMA_TXNUM1_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_TXNUM2 register **/
#define DMA_TXNUM2_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_TXNUM3 register **/
#define DMA_TXNUM3_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_TXNUM4 register **/
#define DMA_TXNUM4_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_TXNUM5 register **/
#define DMA_TXNUM5_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_TXNUM6 register **/
#define DMA_TXNUM6_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_TXNUM7 register **/
#define DMA_TXNUM7_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_TXNUM8 register **/
#define DMA_TXNUM8_NDTX ((uint16_t)0xFFFF) /* Number of data to Transfer */

/** Bit definition for DMA_PADDR1 register **/
#define DMA_PADDR1_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** Bit definition for DMA_PADDR2 register **/
#define DMA_PADDR2_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** it definition for DMA_PADDR3 register **/
#define DMA_PADDR3_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** Bit definition for DMA_PADDR4 register **/
#define DMA_PADDR4_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** Bit definition for DMA_PADDR5 register **/
#define DMA_PADDR5_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** Bit definition for DMA_PADDR6 register **/
#define DMA_PADDR6_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** Bit definition for DMA_PADDR7 register **/
#define DMA_PADDR7_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** Bit definition for DMA_PADDR8 register **/
#define DMA_PADDR8_ADDR ((uint32_t)0xFFFFFFFF) /* Peripheral Address */

/** Bit definition for DMA_MADDR1 register **/
#define DMA_MADDR1_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */

