SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for DMA_MADDR2 register **/
#define DMA_MADDR2_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */

/** Bit definition for DMA_MADDR3 register **/
#define DMA_MADDR3_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */

/** Bit definition for DMA_MADDR4 register **/
#define DMA_MADDR4_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */

/** Bit definition for DMA_MADDR5 register **/
#define DMA_MADDR5_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */

/** Bit definition for DMA_MADDR6 register **/
#define DMA_MADDR6_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */

/** Bit definition for DMA_MADDR7 register **/
#define DMA_MADDR7_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */

/** Bit definition for DMA_MADDR8 register **/
#define DMA_MADDR8_ADDR ((uint32_t)0xFFFFFFFF) /* Memory Address */


/*** Analog to Digital Converter ***/

/** Bit definition for ADC_STS register **/
#define ADC_STS_AWDG     ((uint8_t)0x01)    /* Analog watchdog flag */
#define ADC_STS_ENDC     ((uint8_t)0x02)    /* End of conversion */
#define ADC_STS_JENDC    ((uint8_t)0x04)    /* Injected channel end of conversion */
#define ADC_STS_JSTR     ((uint8_t)0x08)    /* Injected channel Start flag */
#define ADC_STS_STR      ((uint8_t)0x10)    /* Regular channel Start flag */
#define ADC_STS_ENDCA    ((uint8_t)0x20)    /* Regular channel any end flag */
#define ADC_STS_JENDCA   ((uint8_t)0x40)    /* Injected channel any end flag */


/** Bit definition for ADC_CTRL1 register **/
#define ADC_CTRL1_AWDGCH    ((uint32_t)0x0000001F) /* AWDG_CH[4:0] bits (Analog watchdog channel select bits) */
#define ADC_CTRL1_AWDCH_0   ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_CTRL1_AWDCH_1   ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_CTRL1_AWDCH_2   ((uint32_t)0x00000004) /* Bit 2 */
#define ADC_CTRL1_AWDCH_3   ((uint32_t)0x00000008) /* Bit 3 */
#define ADC_CTRL1_AWDCH_4   ((uint32_t)0x00000010) /* Bit 4 */

#define ADC_CTRL1_ENDCIEN   ((uint32_t)0x00000020) /* Interrupt enable for EOC */
#define ADC_CTRL1_AWDGIEN   ((uint32_t)0x00000040) /* Analog Watchdog interrupt enable */
#define ADC_CTRL1_JENDCIEN  ((uint32_t)0x00000080) /* Interrupt enable for injected channels */
#define ADC_CTRL1_SCANMD    ((uint32_t)0x00000100) /* Scan mode */
#define ADC_CTRL1_AWDGSGLEN ((uint32_t)0x00000200) /* Enable the watchdog on a single channel in scan mode */
#define ADC_CTRL1_AUTOJC    ((uint32_t)0x00000400) /* Automatic injected group conversion */
#define ADC_CTRL1_DREGCH    ((uint32_t)0x00000800) /* Discontinuous mode on regular channels */
#define ADC_CTRL1_DJCH      ((uint32_t)0x00001000) /* Discontinuous mode on injected channels */

#define ADC_CTRL1_DCTU      ((uint32_t)0x0000E000) /* DISC_NUM[2:0] bits (Discontinuous mode channel count) */
#define ADC_CTRL1_DCTU_0    ((uint32_t)0x00002000) /* Bit 0 */
#define ADC_CTRL1_DCTU_1    ((uint32_t)0x00004000) /* Bit 1 */
#define ADC_CTRL1_DCTU_2    ((uint32_t)0x00008000) /* Bit 2 */

#define ADC_CTRL1_DUSEL     ((uint32_t)0x000F0000) /* DUSEL[3:0] bits (Dual mode selection) */
#define ADC_CTRL1_DUSEL_0   ((uint32_t)0x00010000) /* Bit 0 */
#define ADC_CTRL1_DUSEL_1   ((uint32_t)0x00020000) /* Bit 1 */
#define ADC_CTRL1_DUSEL_2   ((uint32_t)0x00040000) /* Bit 2 */
#define ADC_CTRL1_DUSEL_3   ((uint32_t)0x00080000) /* Bit 3 */

#define ADC_CTRL1_AWDGEJCH  ((uint32_t)0x00400000) /* Analog watchdog enable on injected channels */
#define ADC_CTRL1_AWDGERCH  ((uint32_t)0x00800000) /* Analog watchdog enable on regular channels */

/** Bit definition for ADC_CTRL2 register **/
#define ADC_CTRL2_ON        ((uint32_t)0x00000001) /* A/D Converter ON / OFF */
#define ADC_CTRL2_CTU       ((uint32_t)0x00000002) /* Continuous Conversion */
#define ADC_CTRL2_ENCAL     ((uint32_t)0x00000004) /* A/D Calibration */
#define ADC_CTRL2_ENDMA     ((uint32_t)0x00000100) /* Direct Memory access mode */
#define ADC_CTRL2_ALIG      ((uint32_t)0x00000800) /* Data Alignment */

#define ADC_CTRL2_EXTJSEL   ((uint32_t)0x00007000) /*  INJ_EXT_SEL[2:0] bits (External event select for injected group) */
#define ADC_CTRL2_EXTJSEL_0 ((uint32_t)0x00001000) /*  Bit 0 */
#define ADC_CTRL2_EXTJSEL_1 ((uint32_t)0x00002000) /*  Bit 1 */
#define ADC_CTRL2_EXTJSEL_2 ((uint32_t)0x00004000) /*  Bit 2 */

#define ADC_CTRL2_EXTJTRIG  ((uint32_t)0x00008000) /*External Trigger Conversion mode for injected channels */

#define ADC_CTRL2_EXTRSEL   ((uint32_t)0x000E0000) /* EXTSEL[2:0] bits (External Event Select for regular group) */
#define ADC_CTRL2_EXTRSEL_0 ((uint32_t)0x00020000) /* Bit 0 */
#define ADC_CTRL2_EXTRSEL_1 ((uint32_t)0x00040000) /* Bit 1 */
#define ADC_CTRL2_EXTRSEL_2 ((uint32_t)0x00080000) /* Bit 2 */

#define ADC_CTRL2_EXTRTRIG  ((uint32_t)0x00100000) /* External Trigger Conversion mode for regular channels */
#define ADC_CTRL2_SWSTRJCH  ((uint32_t)0x00200000) /* Start Conversion of injected channels */
#define ADC_CTRL2_SWSTRRCH  ((uint32_t)0x00400000) /* Start Conversion of regular channels */
#define ADC_CTRL2_TEMPEN    ((uint32_t)0x00800000) /* Temperature Sensor and VREFINT Enable */

/** Bit definition for ADC_SAMPT1 register **/
#define ADC_SAMPT1_SAMP10   ((uint32_t)0x00000007) /* SMP10[2:0] bits (Channel 10 Sample time selection) */
#define ADC_SAMPT1_SAMP10_0 ((uint32_t)0x00000001) /* Bit 0 */
#define ADC_SAMPT1_SAMP10_1 ((uint32_t)0x00000002) /* Bit 1 */
#define ADC_SAMPT1_SAMP10_2 ((uint32_t)0x00000004) /* Bit 2 */

#define ADC_SAMPT1_SAMP11   ((uint32_t)0x00000038) /* SMP11[2:0] bits (Channel 11 Sample time selection) */
#define ADC_SAMPT1_SAMP11_0 ((uint32_t)0x00000008) /* Bit 0 */
#define ADC_SAMPT1_SAMP11_1 ((uint32_t)0x00000010) /* Bit 1 */
#define ADC_SAMPT1_SAMP11_2 ((uint32_t)0x00000020) /* Bit 2 */

#define ADC_SAMPT1_SAMP12   ((uint32_t)0x000001C0) /* SMP12[2:0] bits (Channel 12 Sample time selection) */
#define ADC_SAMPT1_SAMP12_0 ((uint32_t)0x00000040) /* Bit 0 */
#define ADC_SAMPT1_SAMP12_1 ((uint32_t)0x00000080) /* Bit 1 */
#define ADC_SAMPT1_SAMP12_2 ((uint32_t)0x00000100) /* Bit 2 */

#define ADC_SAMPT1_SAMP13   ((uint32_t)0x00000E00) /* SMP13[2:0] bits (Channel 13 Sample time selection) */
#define ADC_SAMPT1_SAMP13_0 ((uint32_t)0x00000200) /* Bit 0 */
#define ADC_SAMPT1_SAMP13_1 ((uint32_t)0x00000400) /* Bit 1 */
#define ADC_SAMPT1_SAMP13_2 ((uint32_t)0x00000800) /* Bit 2 */

