SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/*** COMP ***/

/** COMP_INTEN register **/
#define COMP_INTEN          ((uint16_t)0x0007) /* Interrupt enable for all COMP */
#define COMP_INTEN_CMP1IEN  ((uint16_t)0x0001) /* Interrupt enable for COMP1 */
#define COMP_INTEN_CMP2IEN  ((uint16_t)0x0002) /* Interrupt enable for COMP2 */
#define COMP_INTEN_CMP3IEN  ((uint16_t)0x0004) /* Interrupt enable for COMP3 */

/** COMP_LPCKSEL register **/
#define COMP_LPCKSEL        ((uint16_t)0x0001) /* Comparator clock select during STOP2 and low power run mode */

/** COMP_WINMODE register **/
#define COMP_WINMODE        ((uint16_t)0x0001) /* Comparator window mode */

/** COMP_LOCK register **/
#define COMP_LOCK           ((uint16_t)0x0007) /* All comparator lock enable */
#define COMP_LOCK_CMP1LK    ((uint16_t)0x0001) /* Comparator_1 lock enable */
#define COMP_LOCK_CMP2LK    ((uint16_t)0x0002) /* Comparator_2 lock enable */
#define COMP_LOCK_CMP3LK    ((uint16_t)0x0004) /* Comparator_3 lock enable */

/** COMP1_CTRL register **/
#define COMP1_CTRL_EN        ((uint32_t)0x00000001) /* Comparator_1 enable */

#define COMP1_CTRL_INMSEL    ((uint32_t)0x0000000E) /* Inverting input select of Comparator_1 */
#define COMP1_CTRL_INMSEL_0  ((uint32_t)0x00000002) /* Bit 0 */
#define COMP1_CTRL_INMSEL_1  ((uint32_t)0x00000004) /* Bit 1 */
#define COMP1_CTRL_INMSEL_2  ((uint32_t)0x00000008) /* Bit 2 */

#define COMP1_CTRL_INPSEL    ((uint32_t)0x000000E0) /* Non inverting input select of Comparator_1 */
#define COMP1_CTRL_INPSEL_0  ((uint32_t)0x00000020) /* Bit 0 */
#define COMP1_CTRL_INPSEL_1  ((uint32_t)0x00000040) /* Bit 1 */
#define COMP1_CTRL_INPSEL_2  ((uint32_t)0x00000080) /* Bit 2 */

#define COMP1_CTRL_OUTTRG    ((uint32_t)0x00001E00) /* Output select of Comparator_1 */
#define COMP1_CTRL_OUTTRG_0  ((uint32_t)0x00000200) /* Bit 0 */
#define COMP1_CTRL_OUTTRG_1  ((uint32_t)0x00000400) /* Bit 1 */ 
#define COMP1_CTRL_OUTTRG_2  ((uint32_t)0x00000800) /* Bit 2 */ 
#define COMP1_CTRL_OUTTRG_3  ((uint32_t)0x00001000) /* Bit 3 */ 
 
#define COMP1_CTRL_POL       ((uint32_t)0x00002000) /* Output polarity select of Comparator_1 */

#define COMP1_CTRL_HYST      ((uint32_t)0x0000C000) /* Hysteresis level select of Comparator_1 */
#define COMP1_CTRL_HYST_0    ((uint32_t)0x00004000) /* Bit 0 */
#define COMP1_CTRL_HYST_1    ((uint32_t)0x00008000) /* Bit 1 */

#define COMP1_CTRL_BLKING    ((uint32_t)0x00070000) /* Blanking source select of Comparator_1 */
#define COMP1_CTRL_BLKING_0  ((uint32_t)0x00010000) /* Bit 0 */
#define COMP1_CTRL_BLKING_1  ((uint32_t)0x00020000) /* Bit 1 */
#define COMP1_CTRL_BLKING_2  ((uint32_t)0x00040000) /* Bit 2 */

#define COMP1_CTRL_OUT       ((uint32_t)0x00080000) /* Output state of Comparator_1 */
#define COMP1_CTRL_PWRMODE   ((uint32_t)0x00100000) /* Power mode of Comparator_1 */
#define COMP1_CTRL_FILTVAL   ((uint32_t)0000200000) /* Output state after the digital filter Comparator_1 */


/** COMP1_FILC register **/
#define COMP1_FILC_FILEN     ((uint16_t)0x0001)    /* Comparator_1 filter enable */
#define COMP1_FILC_THRESH    ((uint16_t)0x003E)    /* Comparator_1 filter threshold size */
#define COMP1_FILC_SAMPW     ((uint16_t)0x07C0)    /* Comparator_1 filter window size */

/** COMP1_FILP register **/
#define COMP1_FILP_CLKPSC    ((uint16_t)0xFFFF)    /* Comparator_1 filter sample clock prescale */

/** COMP2_CTRL register **/
#define COMP2_CTRL_EN        ((uint32_t)0x00000001) /* Comparator_2 enable */

#define COMP2_CTRL_INMSEL    ((uint32_t)0x0000000E) /* Inverting input select of Comparator_2 */
#define COMP2_CTRL_INMSEL_0  ((uint32_t)0x00000002) /* Bit 0 */
#define COMP2_CTRL_INMSEL_1  ((uint32_t)0x00000004) /* Bit 1 */
#define COMP2_CTRL_INMSEL_2  ((uint32_t)0x00000008) /* Bit 2 */

#define COMP2_CTRL_INPSEL    ((uint32_t)0x000000E0) /* Non inverting input select of Comparator_2 */
#define COMP2_CTRL_INPSEL_0  ((uint32_t)0x00000020) /* Bit 0 */
#define COMP2_CTRL_INPSEL_1  ((uint32_t)0x00000040) /* Bit 1 */
#define COMP2_CTRL_INPSEL_2  ((uint32_t)0x00000080) /* Bit 2 */

#define COMP2_CTRL_OUTTRG    ((uint32_t)0x00001E00) /* Output select of Comparator_2 */ 
#define COMP2_CTRL_OUTTRG_0  ((uint32_t)0x00000200) /* Bit 0 */
#define COMP2_CTRL_OUTTRG_1  ((uint32_t)0x00000400) /* Bit 1 */ 
#define COMP2_CTRL_OUTTRG_2  ((uint32_t)0x00000800) /* Bit 2 */ 
#define COMP2_CTRL_OUTTRG_3  ((uint32_t)0x00001000) /* Bit 3 */ 
 
#define COMP2_CTRL_POL       ((uint32_t)0x00002000) /* Output polarity select of Comparator_2 */

#define COMP2_CTRL_HYST      ((uint32_t)0x0000C000) /* Hysteresis level select of Comparator_2 */ 
#define COMP2_CTRL_HYST_0    ((uint32_t)0x00004000) /* Bit 0 */
#define COMP2_CTRL_HYST_1    ((uint32_t)0x00008000) /* Bit 1 */

#define COMP2_CTRL_BLKING    ((uint32_t)0x00070000) /* Blanking source select of Comparator_2 */ 
#define COMP2_CTRL_BLKING_0  ((uint32_t)0x00010000) /* Bit 0 */
#define COMP2_CTRL_BLKING_1  ((uint32_t)0x00020000) /* Bit 1 */
#define COMP2_CTRL_BLKING_2  ((uint32_t)0x00040000) /* Bit 2 */

#define COMP2_CTRL_OUT       ((uint32_t)0x00080000) /* Output state of Comparator_2 */
#define COMP2_CTRL_PWRMODE   ((uint32_t)0x00100000) /* Power mode of Comparator_2 */
#define COMP2_CTRL_FILTVAL   ((uint32_t)0x00200000) /* Output state after the digital filter Comparator_2 */


/** COMP2_FILC register **/
#define COMP2_FILC_FILEN     ((uint16_t)0x0001)     /* Comparator_2 filter enable */
#define COMP2_FILC_THRESH    ((uint16_t)0x003E)     /* Comparator_2 filter threshold size */
#define COMP2_FILC_SAMPW     ((uint16_t)0x07C0)     /* Comparator_2 filter window size */

/** COMP2_FILP register **/
#define COMP2_FILP_CLKPSC    ((uint16_t)0xFFFF)     /* Comparator_2 filter sample clock prescale */

/** COMP2_OSEL register **/
#define COMP2_OSEL_CMP2XO    ((uint16_t)0x0001)     /* Comparator_2 XOR output */

/** COMP3_CTRL register **/
#define COMP3_CTRL_EN        ((uint32_t)0x00000001) /* Comparator_3 enable */

#define COMP3_CTRL_INMSEL    ((uint32_t)0x0000000E) /* Inverting input select of Comparator_3 */
#define COMP3_CTRL_INMSEL_0  ((uint32_t)0x00000002) /* Bit 0 */
#define COMP3_CTRL_INMSEL_1  ((uint32_t)0x00000004) /* Bit 1 */
#define COMP3_CTRL_INMSEL_2  ((uint32_t)0x00000008) /* Bit 2 */

#define COMP3_CTRL_INPSEL    ((uint32_t)0x000000E0) /* Non inverting input select of Comparator_3 */
#define COMP3_CTRL_INPSEL_0  ((uint32_t)0x00000020) /* Bit 0 */
#define COMP3_CTRL_INPSEL_1  ((uint32_t)0x00000040) /* Bit 1 */
#define COMP3_CTRL_INPSEL_2  ((uint32_t)0x00000080) /* Bit 2 */

