SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
#define COMP3_CTRL_OUTTRG    ((uint32_t)0x00001E00) /* Output select of Comparator_3 */  
#define COMP3_CTRL_OUTTRG_0  ((uint32_t)0x00000200) /* Bit 0 */
#define COMP3_CTRL_OUTTRG_1  ((uint32_t)0x00000400) /* Bit 1 */ 
#define COMP3_CTRL_OUTTRG_2  ((uint32_t)0x00000800) /* Bit 2 */ 
#define COMP3_CTRL_OUTTRG_3  ((uint32_t)0x00001000) /* Bit 3 */
 
#define COMP3_CTRL_POL       ((uint32_t)0x00002000) /* Output polarity select of Comparator_3 */

#define COMP3_CTRL_HYST      ((uint32_t)0x0000C000) /* Hysteresis level select of Comparator_3 */ 
#define COMP3_CTRL_HYST_0    ((uint32_t)0x00004000) /* Bit 0 */
#define COMP3_CTRL_HYST_1    ((uint32_t)0x00008000) /* Bit 1 */

#define COMP3_CTRL_BLKING    ((uint32_t)0x00070000) /* Blanking source select of Comparator_3 */ 
#define COMP3_CTRL_BLKING_0  ((uint32_t)0x00010000) /* Bit 0 */
#define COMP3_CTRL_BLKING_1  ((uint32_t)0x00020000) /* Bit 1 */
#define COMP3_CTRL_BLKING_2  ((uint32_t)0x00040000) /* Bit 2 */

#define COMP3_CTRL_OUT       ((uint32_t)0x00080000) /* Output state of Comparator_3 */
#define COMP3_CTRL_PWRMODE   ((uint32_t)0x00100000) /* Power mode of Comparator_3 */
#define COMP3_CTRL_FILTVAL   ((uint32_t)0000200000) /* Output state after the digital filter Comparator_3 */


/** COMP3_FILC register **/
#define COMP3_FILC_FILEN     ((uint16_t)0x0001)     /* Comparator_3 filter enable */
#define COMP3_FILC_THRESH    ((uint16_t)0x003E)     /* Comparator_3 filter threshold size */
#define COMP3_FILC_SAMPW     ((uint16_t)0x07C0)     /* Comparator_3 filter window size */

/** COMP3_FILP register **/
#define COMP3_FILP_CLKPSC    ((uint16_t)0xFFFF)     /* Comparator_3 filter sample clock prescale */

/** COMP_VREFSCL register **/
#define COMP_VREFSCL_VV1EN   ((uint32_t)0x0000000001) /* Low-Power DAC1 enable */
#define COMP_VREFSCL_VV1TRM  ((uint32_t)0x000000007E) /* Low-Power DAC1 output voltage size */
#define COMP_VREFSCL_VV2EN   ((uint32_t)0x0000000080) /* Low-Power DAC2 enable */
#define COMP_VREFSCL_VV2TRM  ((uint32_t)0x0000003F00) /* Low-Power DAC2 output voltage size */
#define COMP_VREFSCL_VV3EN   ((uint32_t)0x0000004000) /* Low-Power DAC3 enable */
#define COMP_VREFSCL_VV3TRM  ((uint32_t)0x00001F8000) /* Low-Power DAC3 output voltage size */

/** COMP_TEST register **/
#define COMP_TEST_VEN        ((uint16_t)0x0001) 
#define COMP_TEST_IBEN       ((uint16_t)0x0002) 

/** COMP_INTSTS register **/
#define COMP_INTSTS          ((uint16_t)0x0007)     /* Interrupt status of all Comparator */
#define COMP_INTSTS_COMP1IS  ((uint16_t)0x0001)     /* Interrupt status of Comparator_1 */
#define COMP_INTSTS_COMP2IS  ((uint16_t)0x0002)     /* Interrupt status of Comparator_2 */
#define COMP_INTSTS_COMP3IS  ((uint16_t)0x0004)     /* Interrupt status of Comparator_3 */


/*** TIM ***/

/** Bit definition for TIM_CTRL1 register  **/

#define TIM_CTRL1_CNTEN     ((uint32_t)0x00000001) /* Counter enable */
#define TIM_CTRL1_UPDIS     ((uint32_t)0x00000002) /* Update disable */
#define TIM_CTRL1_UPRS      ((uint32_t)0x00000004) /* Update request source */
#define TIM_CTRL1_ONEPM     ((uint32_t)0x00000008) /* One pulse mode */
#define TIM_CTRL1_DIR       ((uint32_t)0x00000010) /* Direction */

#define TIM_CTRL1_CAMSEL    ((uint32_t)0x00000060) /* CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CTRL1_CAMSEL_0  ((uint32_t)0x00000020) /* Bit 0 */
#define TIM_CTRL1_CAMSEL_1  ((uint32_t)0x00000040) /* Bit 1 */

#define TIM_CTRL1_ARPEN     ((uint32_t)0x00000080) /* Auto-reload preload enable */

#define TIM_CTRL1_CLKD      ((uint32_t)0x00000300) /* CKD[1:0] bits (clock division) */
#define TIM_CTRL1_CLKD_0    ((uint32_t)0x00000100) /* Bit 0 */
#define TIM_CTRL1_CLKD_1    ((uint32_t)0x00000200) /* Bit 1 */

#define TIM_CTRL1_IOMBKPEN  ((uint32_t)0x00000400) /* Break_in selection from IOM/COMP */
#define TIM_CTRL1_C1SEL     ((uint32_t)0x00000800) /* Channel 1 selection from IOM/COMP */
#define TIM_CTRL1_C2SEL     ((uint32_t)0x00001000) /* Channel 2 selection from IOM/COMP */
#define TIM_CTRL1_C3SEL     ((uint32_t)0x00002000) /* Channel 3 selection from IOM/COMP */
#define TIM_CTRL1_C4SEL     ((uint32_t)0x00004000) /* Channel 4 selection from IOM/COMP */
#define TIM_CTRL1_CLRSEL    ((uint32_t)0x00008000) /* OCxRef selection from ETR/COMP */

#define TIM_CTRL1_LBKPEN    ((uint32_t)0x00010000) /* LOCKUP as bkp Enable*/
#define TIM_CTRL1_PBKPEN    ((uint32_t)0x00020000) /* PVD as bkp Enable */

#define TIM_CTRL1_ASMMETRIC ((uint32_t)0x00040000)  /* Asynmmetric mode enable in center-aligned */
#define TIM_CTRL1_CMODE     ((uint32_t)0x00300000)  /* In center-aligned mode, channel 4/7/8/9 trigger mode */
#define TIM_CTRL1_CMODE_0   ((uint32_t)0x00100000)  /* Bit0 */
#define TIM_CTRL1_CMODE_1   ((uint32_t)0x00200000)  /* Bit1 */

/** Bit definition for TIM_CTRL2 register **/
#define TIM_CTRL2_CCPCTL    ((uint32_t)0x00000001) /* Capture/Compare Preloaded Control */
#define TIM_CTRL2_CCUSEL    ((uint32_t)0x00000004) /* Capture/Compare Control Update Selection */
#define TIM_CTRL2_CCDSEL    ((uint32_t)0x00000008) /* Capture/Compare DMA Selection */

#define TIM_CTRL2_MMSEL     ((uint32_t)0x01000070) /* MMS[3:0] bits (Master Mode Selection) */
#define TIM_CTRL2_MMSEL_0   ((uint32_t)0x00000010) /* Bit 0 */
#define TIM_CTRL2_MMSEL_1   ((uint32_t)0x00000020) /* Bit 1 */
#define TIM_CTRL2_MMSEL_2   ((uint32_t)0x00000040) /* Bit 2 */
#define TIM_CTRL3_MMSEL_3   ((uint32_t)0x01000000) /* Bit 3 */

#define TIM_CTRL2_TI1SEL    ((uint32_t)0x00000080) /* TI1 Selection */
#define TIM_CTRL2_TSCSEL    ((uint32_t)0x00000100) /* TSC Selection */

#define TIM_CTRL2_OI1       ((uint32_t)0x00000100) /* Output Idle state 1 (OC1 output) */
#define TIM_CTRL2_OI1N      ((uint32_t)0x00000200) /* Output Idle state 1 (OC1N output) */
#define TIM_CTRL2_OI2       ((uint32_t)0x00000400) /* Output Idle state 2 (OC2 output) */
#define TIM_CTRL2_OI2N      ((uint32_t)0x00000800) /* Output Idle state 2 (OC2N output) */
#define TIM_CTRL2_OI3       ((uint32_t)0x00001000) /* Output Idle state 3 (OC3 output) */
#define TIM_CTRL2_OI3N      ((uint32_t)0x00002000) /* Output Idle state 3 (OC3N output) */
#define TIM_CTRL2_OI4       ((uint32_t)0x00004000) /* Output Idle state 4 (OC4 output) */
#define TIM_CTRL2_OI4N      ((uint32_t)0x00020000) /* Output Idle state 4 (OC4 output) */

#define TIM_CTRL2_TRIG4     ((uint32_t)0x00008000) /* OC4REF  trigger to ADC enable */
#define TIM_CTRL2_OI5       ((uint32_t)0x00010000) /* Output Idle state 5 (OC5 output) */
#define TIM_CTRL2_OI4N      ((uint32_t)0x00020000) /* Output Idle state 4 (OC4N output) */
#define TIM_CTRL2_OI6       ((uint32_t)0x00040000) /* Output Idle state 6 (OC6 output) */
#define TIM_CTRL2_TRIG7      ((uint32_t)0x00080000) /* OC7REF trigger to ADC enable */
#define TIM_CTRL2_TRIG8      ((uint32_t)0x00200000) /* OC7REF trigger to ADC enable */
#define TIM_CTRL2_TRIG9      ((uint32_t)0x00800000) /* OC7REF trigger to ADC enable */

/** Bit definition for TIM_SMCTRL register **/
#define TIM_SMCTRL_SMSEL    ((uint16_t)0x0007) /* SMS[2:0] bits (Slave mode selection) */
#define TIM_SMCTRL_SMSEL_0  ((uint16_t)0x0001) /* Bit 0 */
#define TIM_SMCTRL_SMSEL_1  ((uint16_t)0x0002) /* Bit 1 */
#define TIM_SMCTRL_SMSEL_2  ((uint16_t)0x0004) /* Bit 2 */

#define TIM_SMCTRL_TSEL     ((uint16_t)0x0070) /* TS[2:0] bits (Trigger selection) */
#define TIM_SMCTRL_TSEL_0   ((uint16_t)0x0010) /* Bit 0 */
#define TIM_SMCTRL_TSEL_1   ((uint16_t)0x0020) /* Bit 1 */
#define TIM_SMCTRL_TSEL_2   ((uint16_t)0x0040) /* Bit 2 */

