SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for TIM_PSC register **/
#define TIM_PSC_PSC             ((uint16_t)0xFFFF) /* Prescaler Value */

/** Bit definition for TIM_AR register **/
#define TIM_AR_AR               ((uint16_t)0xFFFF) /* actual auto-reload Value */

/** Bit definition for TIM_REPCNT register **/
#define TIM_REPCNT_REPCNT       ((uint8_t)0xFF) /* Repetition Counter Value */

/** Bit definition for TIM_CCDAT1 register **/
#define TIM_CCDAT1_CCDDAT1      ((uint32_t)0xFFFF0000) /* Capture/Compare 1 down counting Value */
#define TIM_CCDAT1_CCDAT1       ((uint32_t)0x0000FFFF) /* Capture/Compare 1 Value */

/** Bit definition for TIM_CCDAT2 register **/
#define TIM_CCDAT2_CCDDAT2      ((uint32_t)0xFFFF0000) /* Capture/Compare 2 down counting Value */
#define TIM_CCDAT2_CCDAT2       ((uint32_t)0x0000FFFF) /* Capture/Compare 2 Value */

/** Bit definition for TIM_CCDAT3 register **/
#define TIM_CCDAT3_CCDDAT3      ((uint32_t)0xFFFF0000) /* Capture/Compare 3 down counting Value */
#define TIM_CCDAT3_CCDAT3       ((uint32_t)0x0000FFFF) /* Capture/Compare 3 Value */

/** Bit definition for TIM_CCDAT4 register **/
#define TIM_CCDAT4_CCDDAT4      ((uint32_t)0xFFFF0000) /* Capture/Compare 4 down counting Value */
#define TIM_CCDAT4_CCDAT4       ((uint32_t)0x0000FFFF) /* Capture/Compare 4 Value */

/** Bit definition for TIM_CCDAT5 register **/
#define TIM_CCDAT5_CCDAT5       ((uint16_t)0xFFFF) /* Capture/Compare 5 Value */

/** Bit definition for TIM_CCDAT6 register **/
#define TIM_CCDAT6_CCDAT6       ((uint16_t)0xFFFF) /* Capture/Compare 6 Value */

/** Bit definition for TIM_CCDAT7 register **/
#define TIM_CCDAT7_CCDAT7       ((uint16_t)0xFFFF) /* Capture/Compare 7 Value */

/** Bit definition for TIM_CCDAT8 register **/
#define TIM_CCDAT8_CCDAT8       ((uint16_t)0xFFFF) /* Capture/Compare 8 Value */

/** Bit definition for TIM_CCDAT9 register **/
#define TIM_CCDAT9_CCDAT9       ((uint16_t)0xFFFF) /* Capture/Compare 9 Value */

/** Bit definition for TIM_BKDT register **/
#define TIM_BKDT_DTGN           ((uint16_t)0x00FF) /* DTG[0:7] bits (Dead-Time Generator set-up) */
#define TIM_BKDT_DTGN_0         ((uint16_t)0x0001) /* Bit 0 */
#define TIM_BKDT_DTGN_1         ((uint16_t)0x0002) /* Bit 1 */
#define TIM_BKDT_DTGN_2         ((uint16_t)0x0004) /* Bit 2 */
#define TIM_BKDT_DTGN_3         ((uint16_t)0x0008) /* Bit 3 */
#define TIM_BKDT_DTGN_4         ((uint16_t)0x0010) /* Bit 4 */
#define TIM_BKDT_DTGN_5         ((uint16_t)0x0020) /* Bit 5 */
#define TIM_BKDT_DTGN_6         ((uint16_t)0x0040) /* Bit 6 */
#define TIM_BKDT_DTGN_7         ((uint16_t)0x0080) /* Bit 7 */

#define TIM_BKDT_LCKCFG         ((uint16_t)0x0300) /* LOCK[1:0] bits (Lock Configuration) */
#define TIM_BKDT_LCKCFG_0       ((uint16_t)0x0100) /* Bit 0 */
#define TIM_BKDT_LCKCFG_1       ((uint16_t)0x0200) /* Bit 1 */

#define TIM_BKDT_OSSI           ((uint16_t)0x0400) /* Off-State Selection for Idle mode */
#define TIM_BKDT_OSSR           ((uint16_t)0x0800) /* Off-State Selection for Run mode */
#define TIM_BKDT_BKEN           ((uint16_t)0x1000) /* Break enable */
#define TIM_BKDT_BKP            ((uint16_t)0x2000) /* Break Polarity */
#define TIM_BKDT_AOEN           ((uint16_t)0x4000) /* Automatic Output enable */
#define TIM_BKDT_MOEN           ((uint16_t)0x8000) /* Main Output enable */

/** Bit definition for TIM_DCTRL register **/
#define TIM_DCTRL_DBADDR        ((uint16_t)0x001F) /* DBA[4:0] bits (DMA Base Address) */
#define TIM_DCTRL_DBADDR_0      ((uint16_t)0x0001) /* Bit 0 */
#define TIM_DCTRL_DBADDR_1      ((uint16_t)0x0002) /* Bit 1 */
#define TIM_DCTRL_DBADDR_2      ((uint16_t)0x0004) /* Bit 2 */
#define TIM_DCTRL_DBADDR_3      ((uint16_t)0x0008) /* Bit 3 */
#define TIM_DCTRL_DBADDR_4      ((uint16_t)0x0010) /* Bit 4 */

#define TIM_DCTRL_DBLEN         ((uint16_t)0x1F00) /* DBL[4:0] bits (DMA Burst Length) */
#define TIM_DCTRL_DBLEN_0       ((uint16_t)0x0100) /* Bit 0 */
#define TIM_DCTRL_DBLEN_1       ((uint16_t)0x0200) /* Bit 1 */
#define TIM_DCTRL_DBLEN_2       ((uint16_t)0x0400) /* Bit 2 */
#define TIM_DCTRL_DBLEN_3       ((uint16_t)0x0800) /* Bit 3 */
#define TIM_DCTRL_DBLEN_4       ((uint16_t)0x1000) /* Bit 4 */

/** Bit definition for TIM_DADDR register **/
#define TIM_DADDR_BURST         ((uint16_t)0xFFFF) /* DMA register for burst accesses */

/** Bit definition for TIM_BRK_FILT register **/
#define TIM_BRK_FILT_THRESH     ((uint32_t)0x3F000000)
#define TIM_BRK_FILT_WSIZE      ((uint32_t)0x007E0000)
#define TIM_BRK_FILT_FILTEN     ((uint32_t)0x00010000)
#define TIM_BRK_FILT_PSC        ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_C1FILT register **/
#define TIM_C1FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C1FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C1FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C1FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_C2FILT register **/
#define TIM_C2FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C2FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C2FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C2FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_C3FILT register **/
#define TIM_C3FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C3FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C3FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C3FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_C4FILT register **/
#define TIM_C4FILT_THRESH       ((uint32_t)0x3F000000)
#define TIM_C4FILT_WSIZE        ((uint32_t)0x007E0000)
#define TIM_C4FILT_FILTEN       ((uint32_t)0x00010000)
#define TIM_C4FILT_PSC          ((uint32_t)0x0000FFFF)

/** Bit definition for TIM_FILTO register **/
#define TIM_FILTO_C1_FILTO      ((uint32_t)0x00000001)
#define TIM_FILTO_C2_FILTO      ((uint32_t)0x00000002)
#define TIM_FILTO_C3_FILTO      ((uint32_t)0x00000004)
#define TIM_FILTO_C4_FILTO      ((uint32_t)0x00000008)


/*** Low Power Timer (LPTTIM) ***/



/** Bit definition for LPTIM_INTSTS register **/
#define LPTIM_INTSTS_CMPM       ((uint32_t)0x00000001)  /* Compare match */
#define LPTIM_INTSTS_ARRM       ((uint32_t)0x00000002)  /* Autoreload match */
#define LPTIM_INTSTS_EXTRIG     ((uint32_t)0x00000004)  /* External trigger edge event */
#define LPTIM_INTSTS_CMPUPD     ((uint32_t)0x00000008)  /* Compare register update OK */
#define LPTIM_INTSTS_ARRUPD     ((uint32_t)0x00000010)  /* Autoreload register update OK */
#define LPTIM_INTSTS_UP         ((uint32_t)0x00000020)  /* Counter direction change down to up */
#define LPTIM_INTSTS_DOWN       ((uint32_t)0x00000040)  /* Counter direction change up to down */

