SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for LPTIM_INTCLR register **/
#define LPTIM_INTCLR_CMPMCF     ((uint32_t)0x00000001)  /* Compare match Clear Flag */
#define LPTIM_INTCLR_ARRMCF     ((uint32_t)0x00000002)  /* Autoreload match Clear Flag */
#define LPTIM_INTCLR_EXTRIGCF   ((uint32_t)0x00000004)  /* External trigger edge event Clear Flag */
#define LPTIM_INTCLR_CMPUPDCF   ((uint32_t)0x00000008)  /* Compare register update OK Clear Flag */
#define LPTIM_INTCLR_ARRUPDCF   ((uint32_t)0x00000010)  /* Autoreload register update OK Clear Flag */
#define LPTIM_INTCLR_UPCF       ((uint32_t)0x00000020)  /* Counter direction change down to up Clear Flag */
#define LPTIM_INTCLR_DOWNCF     ((uint32_t)0x00000040)  /* Counter direction change up to down Clear Flag */

/** Bit definition for LPTIM_INTEN register **/
#define LPTIM_INTEN_CMPMIE      ((uint32_t)0x00000001)  /* Compare match Interrupt Enable */
#define LPTIM_INTEN_ARRMIE      ((uint32_t)0x00000002)  /* Autoreload match Interrupt Enable */
#define LPTIM_INTEN_EXTRIGIE    ((uint32_t)0x00000004)  /* External trigger edge event Interrupt Enable */
#define LPTIM_INTEN_CMPUPDIE    ((uint32_t)0x00000008)  /* Compare register update OK Interrupt Enable */
#define LPTIM_INTEN_ARRUPDIE    ((uint32_t)0x00000010)  /* Autoreload register update OK Interrupt Enable */
#define LPTIM_INTEN_UPIE        ((uint32_t)0x00000020)  /* Counter direction change down to up Interrupt Enable */
#define LPTIM_INTEN_DOWNIE      ((uint32_t)0x00000040)  /* Counter direction change up to down Interrupt Enable */

/** Bit definition for LPTIM_CFG register **/
#define LPTIM_CFG_CLKSEL        ((uint32_t)0x00000001)  /* Clock selector */

#define LPTIM_CFG_CLKPOL        ((uint32_t)0x00000006)  /* CLKP[1:0] bits (Clock polarity) */
#define LPTIM_CFG_CLKPOL_0      ((uint32_t)0x00000002)  /* Bit 0 */
#define LPTIM_CFG_CLKPOL_1      ((uint32_t)0x00000004)  /* Bit 1 */

#define LPTIM_CFG_CLKFLT        ((uint32_t)0x00000018)  /* CFGDFFEXT[1:0] bits (Configurable digital filter for external clock) */
#define LPTIM_CFG_CLKFLT_0      ((uint32_t)0x00000008)  /* Bit 0 */
#define LPTIM_CFG_CLKFLT_1      ((uint32_t)0x00000010)  /* Bit 1 */

#define LPTIM_CFG_TRIGFLT       ((uint32_t)0x000000C0)  /* CFGDFFTRG[1:0] bits (Configurable digital filter for trigger) */
#define LPTIM_CFG_TRIGFLT_0     ((uint32_t)0x00000040)  /* Bit 0 */
#define LPTIM_CFG_TRIGFLT_1     ((uint32_t)0x00000080)  /* Bit 1 */

#define LPTIM_CFG_CLKPRE        ((uint32_t)0x00000E00)  /* CLKPRE[2:0] bits (Clock prescaler) */
#define LPTIM_CFG_CLKPRE_0      ((uint32_t)0x00000200)  /* Bit 0 */
#define LPTIM_CFG_CLKPRE_1      ((uint32_t)0x00000400)  /* Bit 1 */
#define LPTIM_CFG_CLKPRE_2      ((uint32_t)0x00000800)  /* Bit 2 */

#define LPTIM_CFG_TRGSEL        ((uint32_t)0x0001E000)  /* TRGS[3:0] bits (Trigger selector) */
#define LPTIM_CFG_TRGSEL_0      ((uint32_t)0x00002000)  /* Bit 0 */
#define LPTIM_CFG_TRGSEL_1      ((uint32_t)0x00004000)  /* Bit 1 */
#define LPTIM_CFG_TRGSEL_2      ((uint32_t)0x00008000)  /* Bit 2 */
#define LPTIM_CFG_TRGSEL_3      ((uint32_t)0x00010000)  /* Bit 3 */

#define LPTIM_CFG_TRGEN         ((uint32_t)0x00060000)  /* TRGEN[1:0] bits (Trigger enable and polarity) */
#define LPTIM_CFG_TRGEN_0       ((uint32_t)0x00020000)  /* Bit 0 */
#define LPTIM_CFG_TRGEN_1       ((uint32_t)0x00040000)  /* Bit 1 */

#define LPTIM_CFG_TIMOUTEN      ((uint32_t)0x00080000)  /* Timout enable */
#define LPTIM_CFG_WAVE          ((uint32_t)0x00100000)  /* Waveform shape */
#define LPTIM_CFG_WAVEPOL       ((uint32_t)0x00200000)  /* Waveform shape polarity */
#define LPTIM_CFG_RELOAD        ((uint32_t)0x00400000)  /* Reg update mode */
#define LPTIM_CFG_CNTMEN        ((uint32_t)0x00800000)  /* Counter mode enable */
#define LPTIM_CFG_ENC           ((uint32_t)0x01000000)  /* Encoder mode enable */
#define LPTIM_CFG_NENC          ((uint32_t)0x02000000)  /* NONEncoder mode enable */
/** Bit definition for LPTIM_CTRL register **/
#define LPTIM_CTRL_LPTIMEN      ((uint32_t)0x00000001)  /* LPTIMer enable */
#define LPTIM_CTRL_SNGMST       ((uint32_t)0x00000002)  /* Timer start in single mode */
#define LPTIM_CTRL_TSTCM        ((uint32_t)0x00000004)  /* Timer start in continuous mode */

/** Bit definition for LPTIM_CMPT register **/
#define LPTIM_COMP_CMPVAL       ((uint16_t)0xFFFF)      /* Compare register */

/** Bit definition for LPTIM_AUTRLD register **/
#define LPTIM_ARR_ARRVAL        ((uint16_t)0xFFFF)      /* Auto reload register */

/** Bit definition for LPTIM_CNT register **/
#define LPTIM_CNT_CNTVAL        ((uint16_t)0xFFFF)      /* Counter register */

/** Bit definition for LPTIM_OPT register **/
#define LPTIM_OPT_OPT2          ((uint32_t)0x0000000C)  /* OPT2[1:0] bits () */
#define LPTIM_OPT_OPT2_1        ((uint32_t)0x00000008)  /* Bit 0 */
#define LPTIM_OPT_OPT2_0        ((uint32_t)0x00000004)  /* Bit 1 */

#define LPTIM_OPT_OPT1          ((uint32_t)0x00000003)  /* OPT1[1:0] bits () */
#define LPTIM_OPT_OPT1_1        ((uint32_t)0x00000002)  /* Bit 0 */
#define LPTIM_OPT_OPT1_0        ((uint32_t)0x00000001)  /* Bit 1 */


/*** Real-Time Clock (RTC) ***/

/** Bits definition for RTC_TSH register **/
#define RTC_TSH_APM   ((uint32_t)0x00400000)
#define RTC_TSH_HOT   ((uint32_t)0x00300000)
#define RTC_TSH_HOT_0 ((uint32_t)0x00100000)
#define RTC_TSH_HOT_1 ((uint32_t)0x00200000)
#define RTC_TSH_HOU   ((uint32_t)0x000F0000)
#define RTC_TSH_HOU_0 ((uint32_t)0x00010000)
#define RTC_TSH_HOU_1 ((uint32_t)0x00020000)
#define RTC_TSH_HOU_2 ((uint32_t)0x00040000)
#define RTC_TSH_HOU_3 ((uint32_t)0x00080000)
#define RTC_TSH_MIT   ((uint32_t)0x00007000)
#define RTC_TSH_MIT_0 ((uint32_t)0x00001000)
#define RTC_TSH_MIT_1 ((uint32_t)0x00002000)
#define RTC_TSH_MIT_2 ((uint32_t)0x00004000)
#define RTC_TSH_MIU   ((uint32_t)0x00000F00)
#define RTC_TSH_MIU_0 ((uint32_t)0x00000100)
#define RTC_TSH_MIU_1 ((uint32_t)0x00000200)
#define RTC_TSH_MIU_2 ((uint32_t)0x00000400)
#define RTC_TSH_MIU_3 ((uint32_t)0x00000800)
#define RTC_TSH_SCT   ((uint32_t)0x00000070)
#define RTC_TSH_SCT_0 ((uint32_t)0x00000010)
#define RTC_TSH_SCT_1 ((uint32_t)0x00000020)
#define RTC_TSH_SCT_2 ((uint32_t)0x00000040)
#define RTC_TSH_SCU   ((uint32_t)0x0000000F)
#define RTC_TSH_SCU_0 ((uint32_t)0x00000001)
#define RTC_TSH_SCU_1 ((uint32_t)0x00000002)
#define RTC_TSH_SCU_2 ((uint32_t)0x00000004)
#define RTC_TSH_SCU_3 ((uint32_t)0x00000008)

/** Bits definition for RTC_DATE register **/
#define RTC_DATE_YRT   ((uint32_t)0x00F00000)
#define RTC_DATE_YRT_0 ((uint32_t)0x00100000)
#define RTC_DATE_YRT_1 ((uint32_t)0x00200000)
#define RTC_DATE_YRT_2 ((uint32_t)0x00400000)
#define RTC_DATE_YRT_3 ((uint32_t)0x00800000)
#define RTC_DATE_YRU   ((uint32_t)0x000F0000)
#define RTC_DATE_YRU_0 ((uint32_t)0x00010000)
#define RTC_DATE_YRU_1 ((uint32_t)0x00020000)
#define RTC_DATE_YRU_2 ((uint32_t)0x00040000)
#define RTC_DATE_YRU_3 ((uint32_t)0x00080000)
#define RTC_DATE_WDU   ((uint32_t)0x0000E000)
#define RTC_DATE_WDU_0 ((uint32_t)0x00002000)
#define RTC_DATE_WDU_1 ((uint32_t)0x00004000)
#define RTC_DATE_WDU_2 ((uint32_t)0x00008000)
#define RTC_DATE_MOT   ((uint32_t)0x00001000)
#define RTC_DATE_MOU   ((uint32_t)0x00000F00)
#define RTC_DATE_MOU_0 ((uint32_t)0x00000100)
#define RTC_DATE_MOU_1 ((uint32_t)0x00000200)
#define RTC_DATE_MOU_2 ((uint32_t)0x00000400)
#define RTC_DATE_MOU_3 ((uint32_t)0x00000800)
#define RTC_DATE_DAT   ((uint32_t)0x00000030)
#define RTC_DATE_DAT_0 ((uint32_t)0x00000010)
#define RTC_DATE_DAT_1 ((uint32_t)0x00000020)
#define RTC_DATE_DAU   ((uint32_t)0x0000000F)
#define RTC_DATE_DAU_0 ((uint32_t)0x00000001)
#define RTC_DATE_DAU_1 ((uint32_t)0x00000002)
#define RTC_DATE_DAU_2 ((uint32_t)0x00000004)
#define RTC_DATE_DAU_3 ((uint32_t)0x00000008)

/** Bits definition for RTC_CTRL register **/
#define RTC_CTRL_COEN     ((uint32_t)0x00800000)
#define RTC_CTRL_OUTSEL   ((uint32_t)0x00600000)
#define RTC_CTRL_OUTSEL_0 ((uint32_t)0x00200000)
#define RTC_CTRL_OUTSEL_1 ((uint32_t)0x00400000)
#define RTC_CTRL_OPOL     ((uint32_t)0x00100000)
#define RTC_CTRL_CALOSEL  ((uint32_t)0x00080000)
#define RTC_CTRL_BAKP     ((uint32_t)0x00040000)
#define RTC_CTRL_SU1H     ((uint32_t)0x00020000)
#define RTC_CTRL_AD1H     ((uint32_t)0x00010000)
#define RTC_CTRL_TSIEN    ((uint32_t)0x00008000)
#define RTC_CTRL_WTIEN    ((uint32_t)0x00004000)
#define RTC_CTRL_ALBIEN   ((uint32_t)0x00002000)
#define RTC_CTRL_ALAIEN   ((uint32_t)0x00001000)
#define RTC_CTRL_TSEN     ((uint32_t)0x00000800)
#define RTC_CTRL_WTEN     ((uint32_t)0x00000400)
#define RTC_CTRL_ALBEN    ((uint32_t)0x00000200)
#define RTC_CTRL_ALAEN    ((uint32_t)0x00000100)

#define RTC_CTRL_HFMT      ((uint32_t)0x00000040)
#define RTC_CTRL_BYPS      ((uint32_t)0x00000020)
#define RTC_CTRL_REFCLKEN  ((uint32_t)0x00000010)
#define RTC_CTRL_TEDGE     ((uint32_t)0x00000008)
#define RTC_CTRL_WKUPSEL   ((uint32_t)0x00000007)
#define RTC_CTRL_WKUPSEL_0 ((uint32_t)0x00000001)
#define RTC_CTRL_WKUPSEL_1 ((uint32_t)0x00000002)
#define RTC_CTRL_WKUPSEL_2 ((uint32_t)0x00000004)

/** Bits definition for RTC_INITSTS register **/
#define RTC_INITSTS_RECPF  ((uint32_t)0x00010000)
#define RTC_INITSTS_TAM3F  ((uint32_t)0x00008000)
#define RTC_INITSTS_TAM2F  ((uint32_t)0x00004000)
#define RTC_INITSTS_TAM1F  ((uint32_t)0x00002000)
#define RTC_INITSTS_TISOVF ((uint32_t)0x00001000)
#define RTC_INITSTS_TISF   ((uint32_t)0x00000800)
#define RTC_INITSTS_WTF    ((uint32_t)0x00000400)
#define RTC_INITSTS_ALBF   ((uint32_t)0x00000200)
#define RTC_INITSTS_ALAF   ((uint32_t)0x00000100)
#define RTC_INITSTS_INITM  ((uint32_t)0x00000080)
#define RTC_INITSTS_INITF  ((uint32_t)0x00000040)
#define RTC_INITSTS_RSYF   ((uint32_t)0x00000020)
#define RTC_INITSTS_INITSF ((uint32_t)0x00000010)
#define RTC_INITSTS_SHOPF  ((uint32_t)0x00000008)
#define RTC_INITSTS_WTWF   ((uint32_t)0x00000004)
#define RTC_INITSTS_ALBWF  ((uint32_t)0x00000002)
#define RTC_INITSTS_ALAWF  ((uint32_t)0x00000001)

/** Bits definition for RTC_PRE register **/
#define RTC_PRE_DIVA      ((uint32_t)0x007F0000)
#define RTC_PRE_DIVS      ((uint32_t)0x00007FFF)

/** Bits definition for RTC_WKUPT register **/
#define RTC_WKUPT_WKUPT   ((uint32_t)0x0000FFFF)

/** Bits definition for RTC_ALARMA register **/
#define RTC_ALARMA_MASK4  ((uint32_t)0x80000000)
#define RTC_ALARMA_WKDSEL ((uint32_t)0x40000000)
#define RTC_ALARMA_DTT    ((uint32_t)0x30000000)
#define RTC_ALARMA_DTT_0  ((uint32_t)0x10000000)
#define RTC_ALARMA_DTT_1  ((uint32_t)0x20000000)
#define RTC_ALARMA_DTU    ((uint32_t)0x0F000000)
#define RTC_ALARMA_DTU_0  ((uint32_t)0x01000000)
#define RTC_ALARMA_DTU_1  ((uint32_t)0x02000000)
#define RTC_ALARMA_DTU_2  ((uint32_t)0x04000000)
#define RTC_ALARMA_DTU_3  ((uint32_t)0x08000000)
#define RTC_ALARMA_MASK3  ((uint32_t)0x00800000)
#define RTC_ALARMA_APM    ((uint32_t)0x00400000)
#define RTC_ALARMA_HOT    ((uint32_t)0x00300000)
#define RTC_ALARMA_HOT_0  ((uint32_t)0x00100000)
#define RTC_ALARMA_HOT_1  ((uint32_t)0x00200000)
#define RTC_ALARMA_HOU    ((uint32_t)0x000F0000)
#define RTC_ALARMA_HOU_0  ((uint32_t)0x00010000)
#define RTC_ALARMA_HOU_1  ((uint32_t)0x00020000)
#define RTC_ALARMA_HOU_2  ((uint32_t)0x00040000)
#define RTC_ALARMA_HOU_3  ((uint32_t)0x00080000)
#define RTC_ALARMA_MASK2  ((uint32_t)0x00008000)
#define RTC_ALARMA_MIT    ((uint32_t)0x00007000)
#define RTC_ALARMA_MIT_0  ((uint32_t)0x00001000)
#define RTC_ALARMA_MIT_1  ((uint32_t)0x00002000)
#define RTC_ALARMA_MIT_2  ((uint32_t)0x00004000)
#define RTC_ALARMA_MIU    ((uint32_t)0x00000F00)
#define RTC_ALARMA_MIU_0  ((uint32_t)0x00000100)
#define RTC_ALARMA_MIU_1  ((uint32_t)0x00000200)
#define RTC_ALARMA_MIU_2  ((uint32_t)0x00000400)
#define RTC_ALARMA_MIU_3  ((uint32_t)0x00000800)
#define RTC_ALARMA_MASK1  ((uint32_t)0x00000080)
#define RTC_ALARMA_SET    ((uint32_t)0x00000070)
#define RTC_ALARMA_SET_0  ((uint32_t)0x00000010)
#define RTC_ALARMA_SET_1  ((uint32_t)0x00000020)
#define RTC_ALARMA_SET_2  ((uint32_t)0x00000040)
#define RTC_ALARMA_SEU    ((uint32_t)0x0000000F)
#define RTC_ALARMA_SEU_0  ((uint32_t)0x00000001)
#define RTC_ALARMA_SEU_1  ((uint32_t)0x00000002)
#define RTC_ALARMA_SEU_2  ((uint32_t)0x00000004)
#define RTC_ALARMA_SEU_3  ((uint32_t)0x00000008)

