SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bits definition for RTC_BKP2 register **/
#define RTC_BKP2R     ((uint32_t)0xFFFFFFFF)

/**  Bits definition for RTC_BKP3 register **/
#define RTC_BKP3R     ((uint32_t)0xFFFFFFFF)

/**  Bits definition for RTC_BKP4 register **/
#define RTC_BKP4R     ((uint32_t)0xFFFFFFFF)

/**  Bits definition for RTC_BKP5 register **/
#define RTC_BKP5R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP6 register **/
#define RTC_BKP6R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP7 register **/
#define RTC_BKP7R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP8 register **/
#define RTC_BKP8R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP9 register **/
#define RTC_BKP9R     ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP10 register **/
#define RTC_BKP10R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP11 register **/
#define RTC_BKP11R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP12register **/
#define RTC_BKP12R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP13 register **/
#define RTC_BKP13R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP14 register **/
#define RTC_BKP14R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP15 register **/
#define RTC_BKP15R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP16 register **/
#define RTC_BKP16R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP17register **/
#define RTC_BKP17R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP18 register **/
#define RTC_BKP18R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP19 register **/
#define RTC_BKP19R    ((uint32_t)0xFFFFFFFF)

/** Bits definition for RTC_BKP20 register **/
#define RTC_BKP20R    ((uint32_t)0xFFFFFFFF)


/*** Independent WATCHDOG ***/

/** Bit definition for IWDG_KEY register **/
#define IWDG_KEY_KEYV     ((uint16_t)0xFFFF) /* Key value (write only, read 0000h) */

/** Bit definition for IWDG_PREDIV register **/
#define IWDG_PREDIV_PD    ((uint8_t)0x07)    /* PD[2:0] (Prescaler divider) */
#define IWDG_PREDIV_PD0   ((uint8_t)0x01)    /* Bit 0 */
#define IWDG_PREDIV_PD1   ((uint8_t)0x02)    /* Bit 1 */
#define IWDG_PREDIV_PD2   ((uint8_t)0x04)    /* Bit 2 */

/** Bit definition for IWDG_RELV register **/
#define IWDG_RELV_REL     ((uint16_t)0x0FFF) /* Watchdog counter reload value */

/** Bit definition for IWDG_STS register **/
#define IWDG_STS_PVU      ((uint8_t)0x01)    /* Watchdog prescaler value update */
#define IWDG_STS_CRVU     ((uint8_t)0x02)    /* Watchdog counter reload value update */


/*** Window WATCHDOG ***/

/** Bit definition for WWDG_CTRL register **/
#define WWDG_CTRL_T      ((uint16_t)0x3FFF)     /*T[13:0] bits(14-bit counter (MSB to LSB)) */
#define WWDG_CTRL_T0     ((uint16_t)0x0001)     /* Bit 0  */
#define WWDG_CTRL_T1     ((uint16_t)0x0002)     /* Bit 1  */
#define WWDG_CTRL_T2     ((uint16_t)0x0004)     /* Bit 2  */
#define WWDG_CTRL_T3     ((uint16_t)0x0008)     /* Bit 3  */
#define WWDG_CTRL_T4     ((uint16_t)0x0010)     /* Bit 4  */
#define WWDG_CTRL_T5     ((uint16_t)0x0020)     /* Bit 5  */
#define WWDG_CTRL_T6     ((uint16_t)0x0040)     /* Bit 6  */
#define WWDG_CTRL_T7     ((uint16_t)0x0080)     /* Bit 7  */
#define WWDG_CTRL_T8     ((uint16_t)0x0100)     /* Bit 8  */
#define WWDG_CTRL_T9     ((uint16_t)0x0200)     /* Bit 9  */
#define WWDG_CTRL_T10    ((uint16_t)0x0400)     /* Bit 10 */
#define WWDG_CTRL_T11    ((uint16_t)0x0800)     /* Bit 11 */
#define WWDG_CTRL_T12    ((uint16_t)0x1000)     /* Bit 12 */
#define WWDG_CTRL_T13    ((uint16_t)0x2000)     /* Bit 13 */

#define WWDG_CTRL_ACTB   ((uint16_t)0x4000) /* Activation bit */

/**  Bit definition for WWDG_CFG register **/
#define WWDG_CFG_W       ((uint32_t)0x00003FFF) /* W[13:0] bits (14-bit window value) */
#define WWDG_CFG_W0      ((uint32_t)0x00000001) /* Bit 0 */
#define WWDG_CFG_W1      ((uint32_t)0x00000002) /* Bit 1 */
#define WWDG_CFG_W2      ((uint32_t)0x00000004) /* Bit 2 */
#define WWDG_CFG_W3      ((uint32_t)0x00000008) /* Bit 3 */
#define WWDG_CFG_W4      ((uint32_t)0x00000010) /* Bit 4 */
#define WWDG_CFG_W5      ((uint32_t)0x00000020) /* Bit 5 */
#define WWDG_CFG_W6      ((uint32_t)0x00000040) /* Bit 6 */
#define WWDG_CFG_W7      ((uint32_t)0x00000080) /* Bit 7  */
#define WWDG_CFG_W8      ((uint32_t)0x00000100) /* Bit 8  */
#define WWDG_CFG_W9      ((uint32_t)0x00000200) /* Bit 9  */
#define WWDG_CFG_W10     ((uint32_t)0x00000400) /* Bit 10 */
#define WWDG_CFG_W11     ((uint32_t)0x00000800) /* Bit 11 */
#define WWDG_CFG_W12     ((uint32_t)0x00001000) /* Bit 12 */
#define WWDG_CFG_W13     ((uint32_t)0x00002000) /* Bit 13 */

#define WWDG_CFG_TIMERB  ((uint32_t)0x0000C000) /* WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFG_TIMERB0 ((uint32_t)0x00004000) /* Bit 0 */
#define WWDG_CFG_TIMERB1 ((uint32_t)0x00008000) /* Bit 1 */

#define WWDG_CFG_EWINT   ((uint32_t)0x00010000) /* Early Wakeup Interrupt */

/** Bit definition for WWDG_STS register **/
#define WWDG_STS_EWINTF  ((uint8_t)0x01)        /* Early Wakeup Interrupt Flag */


/*** CAN control and status registers ***/

/** Bit definition for CAN_MCTRL register **/
#define CAN_MCTRL_INIRQ ((uint16_t)0x0001) /* Initialization Request */
#define CAN_MCTRL_SLPRQ ((uint16_t)0x0002) /* Sleep Mode Request */
#define CAN_MCTRL_TXFP  ((uint16_t)0x0004) /* Transmit DATFIFO Priority */
#define CAN_MCTRL_RFLM  ((uint16_t)0x0008) /* Receive DATFIFO Locked Mode */
#define CAN_MCTRL_NART  ((uint16_t)0x0010) /* No Automatic Retransmission */
#define CAN_MCTRL_AWKUM ((uint16_t)0x0020) /* Automatic Wakeup Mode */
#define CAN_MCTRL_ABOM  ((uint16_t)0x0040) /* Automatic Bus-Off Management */
#define CAN_MCTRL_TTCM  ((uint16_t)0x0080) /* Time Triggered Communication Mode */
#define CAN_MCTRL_MRST  ((uint16_t)0x8000) /* CAN software master reset */
#define CAN_MCTRL_DBGF  ((uint32_t)0x00010000) /* CAN Debug freeze */

/** Bit definition for CAN_MSTS register  **/
#define CAN_MSTS_INIAK   ((uint16_t)0x0001) /* Initialization Acknowledge */
#define CAN_MSTS_SLPAK   ((uint16_t)0x0002) /* Sleep Acknowledge */
#define CAN_MSTS_ERRINT  ((uint16_t)0x0004) /* Error Interrupt */
#define CAN_MSTS_WKUINT  ((uint16_t)0x0008) /* Wakeup Interrupt */
#define CAN_MSTS_SLAKINT ((uint16_t)0x0010) /* Sleep Acknowledge Interrupt */
#define CAN_MSTS_TXMD    ((uint16_t)0x0100) /* Transmit Mode */
#define CAN_MSTS_RXMD    ((uint16_t)0x0200) /* Receive Mode */
#define CAN_MSTS_LSMP    ((uint16_t)0x0400) /* Last Sample Point */
#define CAN_MSTS_RXS     ((uint16_t)0x0800) /* CAN Rx Signal */

/** Bit definition for CAN_TSTS register **/
#define CAN_TSTS_RQCPM0 ((uint32_t)0x00000001) /* Request Completed Mailbox0 */
#define CAN_TSTS_TXOKM0 ((uint32_t)0x00000002) /* Transmission OK of Mailbox0 */
#define CAN_TSTS_ALSTM0 ((uint32_t)0x00000004) /* Arbitration Lost for Mailbox0 */
#define CAN_TSTS_TERRM0 ((uint32_t)0x00000008) /* Transmission Error of Mailbox0 */
#define CAN_TSTS_ABRQM0 ((uint32_t)0x00000080) /* Abort Request for Mailbox0 */
#define CAN_TSTS_RQCPM1 ((uint32_t)0x00000100) /* Request Completed Mailbox1 */
#define CAN_TSTS_TXOKM1 ((uint32_t)0x00000200) /* Transmission OK of Mailbox1 */
#define CAN_TSTS_ALSTM1 ((uint32_t)0x00000400) /* Arbitration Lost for Mailbox1 */
#define CAN_TSTS_TERRM1 ((uint32_t)0x00000800) /* Transmission Error of Mailbox1 */
#define CAN_TSTS_ABRQM1 ((uint32_t)0x00008000) /* Abort Request for Mailbox 1 */
#define CAN_TSTS_RQCPM2 ((uint32_t)0x00010000) /* Request Completed Mailbox2 */
#define CAN_TSTS_TXOKM2 ((uint32_t)0x00020000) /* Transmission OK of Mailbox 2 */
#define CAN_TSTS_ALSTM2 ((uint32_t)0x00040000) /* Arbitration Lost for mailbox 2 */
#define CAN_TSTS_TERRM2 ((uint32_t)0x00080000) /* Transmission Error of Mailbox 2 */
#define CAN_TSTS_ABRQM2 ((uint32_t)0x00800000) /* Abort Request for Mailbox 2 */

#define CAN_TSTS_CODE       ((uint32_t)0x03000000) /* Mailbox Code */
#define CAN_TSTS_CODE_0     ((uint32_t)0x01000000) /* Bit 0 */
#define CAN_TSTS_CODE_1     ((uint32_t)0x02000000) /* Bit 1 */

#define CAN_TSTS_TMEM  ((uint32_t)0x1C000000) /* TME[2:0] bits */
#define CAN_TSTS_TMEM0 ((uint32_t)0x04000000) /* Transmit Mailbox 0 Empty */
#define CAN_TSTS_TMEM1 ((uint32_t)0x08000000) /* Transmit Mailbox 1 Empty */
#define CAN_TSTS_TMEM2 ((uint32_t)0x10000000) /* Transmit Mailbox 2 Empty */

#define CAN_TSTS_LOWM  ((uint32_t)0xE0000000) /* LOW[2:0] bits */
#define CAN_TSTS_LOWM0 ((uint32_t)0x20000000) /* Lowest Priority Flag for Mailbox 0 */
#define CAN_TSTS_LOWM1 ((uint32_t)0x40000000) /* Lowest Priority Flag for Mailbox 1 */
#define CAN_TSTS_LOWM2 ((uint32_t)0x80000000) /* Lowest Priority Flag for Mailbox 2 */

/** Bit definition for CAN_RFF0 register **/
#define CAN_RFF0_FFMP0      ((uint8_t)0x03) /* DATFIFO 0 Message Pending */
#define CAN_RFF0_FFMP0_0    ((uint8_t)0x01) /* Bit 0 */
#define CAN_RFF0_FFMP0_1    ((uint8_t)0x02) /* Bit 1 */

#define CAN_RFF0_FFULL0 ((uint8_t)0x08) /* DATFIFO 0 Full */
#define CAN_RFF0_FFOVR0 ((uint8_t)0x10) /* DATFIFO 0 Overrun */
#define CAN_RFF0_RFFOM0 ((uint8_t)0x20) /* Release DATFIFO 0 Output Mailbox */

/** Bit definition for CAN_RFF1 register **/
#define CAN_RFF1_FFMP1      ((uint8_t)0x03) /* DATFIFO 1 Message Pending */
#define CAN_RFF1_FFMP1_0    ((uint8_t)0x01) /* Bit 0 */
#define CAN_RFF1_FFMP1_1    ((uint8_t)0x02) /* Bit 1 */

