SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
#define CAN_RFF1_FFULL1     ((uint8_t)0x08) /* DATFIFO 1 Full */
#define CAN_RFF1_FFOVR1     ((uint8_t)0x10) /* DATFIFO 1 Overrun */
#define CAN_RFF1_RFFOM1     ((uint8_t)0x20) /* Release DATFIFO 1 Output Mailbox */

/** Bit definition for CAN_INTE register **/
#define CAN_INTE_TMEITE  ((uint32_t)0x00000001) /* Transmit Mailbox Empty Interrupt Enable */
#define CAN_INTE_FMPITE0 ((uint32_t)0x00000002) /* DATFIFO Message Pending Interrupt Enable */
#define CAN_INTE_FFITE0  ((uint32_t)0x00000004) /* DATFIFO Full Interrupt Enable */
#define CAN_INTE_FOVITE0 ((uint32_t)0x00000008) /* DATFIFO Overrun Interrupt Enable */
#define CAN_INTE_FMPITE1 ((uint32_t)0x00000010) /* DATFIFO Message Pending Interrupt Enable */
#define CAN_INTE_FFITE1  ((uint32_t)0x00000020) /* DATFIFO Full Interrupt Enable */
#define CAN_INTE_FOVITE1 ((uint32_t)0x00000040) /* DATFIFO Overrun Interrupt Enable */
#define CAN_INTE_EWGITE  ((uint32_t)0x00000100) /* Error Warning Interrupt Enable */
#define CAN_INTE_EPVITE  ((uint32_t)0x00000200) /* Error Passive Interrupt Enable */
#define CAN_INTE_BOFITE  ((uint32_t)0x00000400) /* Bus-Off Interrupt Enable */
#define CAN_INTE_LECITE  ((uint32_t)0x00000800) /* Last Error Code Interrupt Enable */
#define CAN_INTE_ERRITE  ((uint32_t)0x00008000) /* Error Interrupt Enable */
#define CAN_INTE_WKUITE  ((uint32_t)0x00010000) /* Wakeup Interrupt Enable */
#define CAN_INTE_SLKITE  ((uint32_t)0x00020000) /* Sleep Interrupt Enable */

/** Bit definition for CAN_ESTS register **/
#define CAN_ESTS_EWGFL ((uint32_t)0x00000001) /* Error Warning Flag */
#define CAN_ESTS_EPVFL ((uint32_t)0x00000002) /* Error Passive Flag */
#define CAN_ESTS_BOFFL ((uint32_t)0x00000004) /* Bus-Off Flag */

#define CAN_ESTS_LEC   ((uint32_t)0x00000070) /* LEC[2:0] bits (Last Error Code) */
#define CAN_ESTS_LEC_0 ((uint32_t)0x00000010) /* Bit 0 */
#define CAN_ESTS_LEC_1 ((uint32_t)0x00000020) /* Bit 1 */
#define CAN_ESTS_LEC_2 ((uint32_t)0x00000040) /* Bit 2 */

#define CAN_ESTS_TXEC  ((uint32_t)0x00FF0000) /* Least significant byte of the 9-bit Transmit Error Counter */
#define CAN_ESTS_RXEC  ((uint32_t)0xFF000000) /* Receive Error Counter */

/** Bit definition for CAN_BTIM register **/
#define CAN_BTIM_BRTP   ((uint32_t)0x000003FF) /* Baud Rate Prescaler */

#define CAN_BTIM_TBS1   ((uint32_t)0x000F0000) /* Time Segment 1 */
#define CAN_BTIM_TBS1_0 ((uint32_t)0x00010000) /* Bit 0 */
#define CAN_BTIM_TBS1_1 ((uint32_t)0x00020000) /* Bit 1 */
#define CAN_BTIM_TBS1_2 ((uint32_t)0x00040000) /* Bit 2 */
#define CAN_BTIM_TBS1_3 ((uint32_t)0x00080000) /* Bit 3 */

#define CAN_BTIM_TBS2   ((uint32_t)0x00700000) /* Time Segment 2 */
#define CAN_BTIM_TBS2_0 ((uint32_t)0x00100000) /* Bit 0 */
#define CAN_BTIM_TBS2_1 ((uint32_t)0x00200000) /* Bit 1 */
#define CAN_BTIM_TBS2_2 ((uint32_t)0x00400000) /* Bit 2 */

#define CAN_BTIM_RSJW   ((uint32_t)0x03000000) /* Resynchronization Jump Width */
#define CAN_BTIM_RSJW_0 ((uint32_t)0x01000000) /* Bit 0 */
#define CAN_BTIM_RSJW_1 ((uint32_t)0x02000000) /* Bit 1 */

#define CAN_BTIM_LBM  ((uint32_t)0x40000000) /* Loop Back Mode (Debug) */
#define CAN_BTIM_SLM  ((uint32_t)0x80000000) /* Silent Mode */

/*** Mailbox registers ***/
/** Bit definition for CAN_TMI0 register **/
#define CAN_TMI0_TXRQ  ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TMI0_RTRQ  ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TMI0_IDE   ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TMI0_EXTID ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_TMI0_STDID ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/** Bit definition for CAN_TMDT0 register **/
#define CAN_TMDT0_DLC  ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TMDT0_TGT  ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TMDT0_MTIM ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/** Bit definition for CAN_TMDL0 register **/
#define CAN_TMDL0_DATA0 ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_TMDL0_DATA1 ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_TMDL0_DATA2 ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_TMDL0_DATA3 ((uint32_t)0xFF000000) /* Data byte 3 */

/** Bit definition for CAN_TMDH0 register **/
#define CAN_TMDH0_DATA4 ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_TMDH0_DATA5 ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_TMDH0_DATA6 ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_TMDH0_DATA7 ((uint32_t)0xFF000000) /* Data byte 7 */

/** Bit definition for CAN_TMI1 register **/
#define CAN_TMI1_TXRQ  ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TMI1_RTRQ  ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TMI1_IDE   ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TMI1_EXTID ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_TMI1_STDID ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/** Bit definition for CAN_TMDT1 register **/
#define CAN_TMDT1_DLC  ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TMDT1_TGT  ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TMDT1_MTIM ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/** Bit definition for CAN_TMDL1 register **/
#define CAN_TMDL1_DATA0 ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_TMDL1_DATA1 ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_TMDL1_DATA2 ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_TMDL1_DATA3 ((uint32_t)0xFF000000) /* Data byte 3 */

/** Bit definition for CAN_TMDH1 register **/
#define CAN_TMDH1_DATA4 ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_TMDH1_DATA5 ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_TMDH1_DATA6 ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_TMDH1_DATA7 ((uint32_t)0xFF000000) /* Data byte 7 */

/** Bit definition for CAN_TMI2 register **/
#define CAN_TMI2_TXRQ  ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TMI2_RTRQ  ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TMI2_IDE   ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TMI2_EXTID ((uint32_t)0x001FFFF8) /* Extended identifier */
#define CAN_TMI2_STDID ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

