SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for CAN_TMDT2 register **/
#define CAN_TMDT2_DLC  ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TMDT2_TGT  ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TMDT2_MTIM ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/** Bit definition for CAN_TMDL2 register **/
#define CAN_TMDL2_DATA0 ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_TMDL2_DATA1 ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_TMDL2_DATA2 ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_TMDL2_DATA3 ((uint32_t)0xFF000000) /* Data byte 3 */

/** Bit definition for CAN_TMDH2 register **/
#define CAN_TMDH2_DATA4 ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_TMDH2_DATA5 ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_TMDH2_DATA6 ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_TMDH2_DATA7 ((uint32_t)0xFF000000) /* Data byte 7 */

/** Bit definition for CAN_RMI0 register **/
#define CAN_RMI0_RTRQ  ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_RMI0_IDE   ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_RMI0_EXTID ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_RMI0_STDID ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/** Bit definition for CAN_RMDT0 register **/
#define CAN_RMDT0_DLC  ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_RMDT0_FMI  ((uint32_t)0x0000FF00) /* Filter Match Index */
#define CAN_RMDT0_MTIM ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/** Bit definition for CAN_RMDL0 register **/
#define CAN_RMDL0_DATA0 ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_RMDL0_DATA1 ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_RMDL0_DATA2 ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_RMDL0_DATA3 ((uint32_t)0xFF000000) /* Data byte 3 */

/** Bit definition for CAN_RMDH0 register **/
#define CAN_RMDH0_DATA4 ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_RMDH0_DATA5 ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_RMDH0_DATA6 ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_RMDH0_DATA7 ((uint32_t)0xFF000000) /* Data byte 7 */

/** Bit definition for CAN_RMI1 register **/
#define CAN_RMI1_RTRQ  ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_RMI1_IDE   ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_RMI1_EXTID ((uint32_t)0x001FFFF8) /* Extended identifier */
#define CAN_RMI1_STDID ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/** Bit definition for CAN_RMDT1 register **/
#define CAN_RMDT1_DLC  ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_RMDT1_FMI  ((uint32_t)0x0000FF00) /* Filter Match Index */
#define CAN_RMDT1_MTIM ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/** Bit definition for CAN_RMDL1 register **/
#define CAN_RMDL1_DATA0 ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_RMDL1_DATA1 ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_RMDL1_DATA2 ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_RMDL1_DATA3 ((uint32_t)0xFF000000) /* Data byte 3 */

/** Bit definition for CAN_RMDH1 register **/
#define CAN_RMDH1_DATA4 ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_RMDH1_DATA5 ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_RMDH1_DATA6 ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_RMDH1_DATA7 ((uint32_t)0xFF000000) /* Data byte 7 */

/*** CAN filter registers ***/
/** Bit definition for CAN_FMC register **/
#define CAN_FMC_FINITM ((uint8_t)0x01) /* Filter Init Mode */

/** Bit definition for CAN_FM1 register **/
#define CAN_FM1_FB   ((uint16_t)0x3FFF) /* Filter Mode */
#define CAN_FM1_FB0  ((uint16_t)0x0001) /* Filter Init Mode bit 0 */
#define CAN_FM1_FB1  ((uint16_t)0x0002) /* Filter Init Mode bit 1 */
#define CAN_FM1_FB2  ((uint16_t)0x0004) /* Filter Init Mode bit 2 */
#define CAN_FM1_FB3  ((uint16_t)0x0008) /* Filter Init Mode bit 3 */
#define CAN_FM1_FB4  ((uint16_t)0x0010) /* Filter Init Mode bit 4 */
#define CAN_FM1_FB5  ((uint16_t)0x0020) /* Filter Init Mode bit 5 */
#define CAN_FM1_FB6  ((uint16_t)0x0040) /* Filter Init Mode bit 6 */
#define CAN_FM1_FB7  ((uint16_t)0x0080) /* Filter Init Mode bit 7 */
#define CAN_FM1_FB8  ((uint16_t)0x0100) /* Filter Init Mode bit 8 */
#define CAN_FM1_FB9  ((uint16_t)0x0200) /* Filter Init Mode bit 9 */
#define CAN_FM1_FB10 ((uint16_t)0x0400) /* Filter Init Mode bit 10 */
#define CAN_FM1_FB11 ((uint16_t)0x0800) /* Filter Init Mode bit 11 */
#define CAN_FM1_FB12 ((uint16_t)0x1000) /* Filter Init Mode bit 12 */
#define CAN_FM1_FB13 ((uint16_t)0x2000) /* Filter Init Mode bit 13 */

/** Bit definition for CAN_FS1 register **/
#define CAN_FS1_FSC   ((uint16_t)0x3FFF) /* Filter Scale Configuration */
#define CAN_FS1_FSC0  ((uint16_t)0x0001) /* Filter Scale Configuration bit 0 */
#define CAN_FS1_FSC1  ((uint16_t)0x0002) /* Filter Scale Configuration bit 1 */
#define CAN_FS1_FSC2  ((uint16_t)0x0004) /* Filter Scale Configuration bit 2 */
#define CAN_FS1_FSC3  ((uint16_t)0x0008) /* Filter Scale Configuration bit 3 */
#define CAN_FS1_FSC4  ((uint16_t)0x0010) /* Filter Scale Configuration bit 4 */
#define CAN_FS1_FSC5  ((uint16_t)0x0020) /* Filter Scale Configuration bit 5 */
#define CAN_FS1_FSC6  ((uint16_t)0x0040) /* Filter Scale Configuration bit 6 */
#define CAN_FS1_FSC7  ((uint16_t)0x0080) /* Filter Scale Configuration bit 7 */
#define CAN_FS1_FSC8  ((uint16_t)0x0100) /* Filter Scale Configuration bit 8 */
#define CAN_FS1_FSC9  ((uint16_t)0x0200) /* Filter Scale Configuration bit 9 */
#define CAN_FS1_FSC10 ((uint16_t)0x0400) /* Filter Scale Configuration bit 10 */
#define CAN_FS1_FSC11 ((uint16_t)0x0800) /* Filter Scale Configuration bit 11 */
#define CAN_FS1_FSC12 ((uint16_t)0x1000) /* Filter Scale Configuration bit 12 */
#define CAN_FS1_FSC13 ((uint16_t)0x2000) /* Filter Scale Configuration bit 13 */

/** Bit definition for CAN_FFA1 register **/
#define CAN_FFA1_FAF   ((uint16_t)0x3FFF) /* Filter DATFIFO Assignment */
#define CAN_FFA1_FAF0  ((uint16_t)0x0001) /* Filter DATFIFO Assignment for Filter 0 */
#define CAN_FFA1_FAF1  ((uint16_t)0x0002) /* Filter DATFIFO Assignment for Filter 1 */
#define CAN_FFA1_FAF2  ((uint16_t)0x0004) /* Filter DATFIFO Assignment for Filter 2 */
#define CAN_FFA1_FAF3  ((uint16_t)0x0008) /* Filter DATFIFO Assignment for Filter 3 */
#define CAN_FFA1_FAF4  ((uint16_t)0x0010) /* Filter DATFIFO Assignment for Filter 4 */
#define CAN_FFA1_FAF5  ((uint16_t)0x0020) /* Filter DATFIFO Assignment for Filter 5 */
#define CAN_FFA1_FAF6  ((uint16_t)0x0040) /* Filter DATFIFO Assignment for Filter 6 */
#define CAN_FFA1_FAF7  ((uint16_t)0x0080) /* Filter DATFIFO Assignment for Filter 7 */
#define CAN_FFA1_FAF8  ((uint16_t)0x0100) /* Filter DATFIFO Assignment for Filter 8 */
#define CAN_FFA1_FAF9  ((uint16_t)0x0200) /* Filter DATFIFO Assignment for Filter 9 */
#define CAN_FFA1_FAF10 ((uint16_t)0x0400) /* Filter DATFIFO Assignment for Filter 10 */
#define CAN_FFA1_FAF11 ((uint16_t)0x0800) /* Filter DATFIFO Assignment for Filter 11 */
#define CAN_FFA1_FAF12 ((uint16_t)0x1000) /* Filter DATFIFO Assignment for Filter 12 */
#define CAN_FFA1_FAF13 ((uint16_t)0x2000) /* Filter DATFIFO Assignment for Filter 13 */

/** Bit definition for CAN_FA1 register **/
#define CAN_FA1_FAC   ((uint16_t)0x3FFF) /* Filter Active */
#define CAN_FA1_FAC0  ((uint16_t)0x0001) /* Filter 0 Active */
#define CAN_FA1_FAC1  ((uint16_t)0x0002) /* Filter 1 Active */
#define CAN_FA1_FAC2  ((uint16_t)0x0004) /* Filter 2 Active */
#define CAN_FA1_FAC3  ((uint16_t)0x0008) /* Filter 3 Active */
#define CAN_FA1_FAC4  ((uint16_t)0x0010) /* Filter 4 Active */
#define CAN_FA1_FAC5  ((uint16_t)0x0020) /* Filter 5 Active */
#define CAN_FA1_FAC6  ((uint16_t)0x0040) /* Filter 6 Active */
#define CAN_FA1_FAC7  ((uint16_t)0x0080) /* Filter 7 Active */
#define CAN_FA1_FAC8  ((uint16_t)0x0100) /* Filter 8 Active */
#define CAN_FA1_FAC9  ((uint16_t)0x0200) /* Filter 9 Active */
#define CAN_FA1_FAC10 ((uint16_t)0x0400) /* Filter 10 Active */
#define CAN_FA1_FAC11 ((uint16_t)0x0800) /* Filter 11 Active */
#define CAN_FA1_FAC12 ((uint16_t)0x1000) /* Filter 12 Active */
#define CAN_FA1_FAC13 ((uint16_t)0x2000) /* Filter 13 Active */

/** Bit definition for CAN_F0R1 register **/
#define CAN_F0B1_FBC0  ((uint32_t)0x00000001) /* Filter bit 0 */
#define CAN_F0B1_FBC1  ((uint32_t)0x00000002) /* Filter bit 1 */
#define CAN_F0B1_FBC2  ((uint32_t)0x00000004) /* Filter bit 2 */
#define CAN_F0B1_FBC3  ((uint32_t)0x00000008) /* Filter bit 3 */
#define CAN_F0B1_FBC4  ((uint32_t)0x00000010) /* Filter bit 4 */
#define CAN_F0B1_FBC5  ((uint32_t)0x00000020) /* Filter bit 5 */
#define CAN_F0B1_FBC6  ((uint32_t)0x00000040) /* Filter bit 6 */
#define CAN_F0B1_FBC7  ((uint32_t)0x00000080) /* Filter bit 7 */
#define CAN_F0B1_FBC8  ((uint32_t)0x00000100) /* Filter bit 8 */
#define CAN_F0B1_FBC9  ((uint32_t)0x00000200) /* Filter bit 9 */
#define CAN_F0B1_FBC10 ((uint32_t)0x00000400) /* Filter bit 10 */
#define CAN_F0B1_FBC11 ((uint32_t)0x00000800) /* Filter bit 11 */
#define CAN_F0B1_FBC12 ((uint32_t)0x00001000) /* Filter bit 12 */
#define CAN_F0B1_FBC13 ((uint32_t)0x00002000) /* Filter bit 13 */
#define CAN_F0B1_FBC14 ((uint32_t)0x00004000) /* Filter bit 14 */
#define CAN_F0B1_FBC15 ((uint32_t)0x00008000) /* Filter bit 15 */
#define CAN_F0B1_FBC16 ((uint32_t)0x00010000) /* Filter bit 16 */
#define CAN_F0B1_FBC17 ((uint32_t)0x00020000) /* Filter bit 17 */
#define CAN_F0B1_FBC18 ((uint32_t)0x00040000) /* Filter bit 18 */
#define CAN_F0B1_FBC19 ((uint32_t)0x00080000) /* Filter bit 19 */
#define CAN_F0B1_FBC20 ((uint32_t)0x00100000) /* Filter bit 20 */
#define CAN_F0B1_FBC21 ((uint32_t)0x00200000) /* Filter bit 21 */
#define CAN_F0B1_FBC22 ((uint32_t)0x00400000) /* Filter bit 22 */
#define CAN_F0B1_FBC23 ((uint32_t)0x00800000) /* Filter bit 23 */
#define CAN_F0B1_FBC24 ((uint32_t)0x01000000) /* Filter bit 24 */
#define CAN_F0B1_FBC25 ((uint32_t)0x02000000) /* Filter bit 25 */
#define CAN_F0B1_FBC26 ((uint32_t)0x04000000) /* Filter bit 26 */
#define CAN_F0B1_FBC27 ((uint32_t)0x08000000) /* Filter bit 27 */
#define CAN_F0B1_FBC28 ((uint32_t)0x10000000) /* Filter bit 28 */
#define CAN_F0B1_FBC29 ((uint32_t)0x20000000) /* Filter bit 29 */
#define CAN_F0B1_FBC30 ((uint32_t)0x40000000) /* Filter bit 30 */
#define CAN_F0B1_FBC31 ((uint32_t)0x80000000) /* Filter bit 31 */

/** Bit definition for CAN_F1R1 register **/
#define CAN_F1B1_FBC0  ((uint32_t)0x00000001) /* Filter bit 0 */
#define CAN_F1B1_FBC1  ((uint32_t)0x00000002) /* Filter bit 1 */
#define CAN_F1B1_FBC2  ((uint32_t)0x00000004) /* Filter bit 2 */
#define CAN_F1B1_FBC3  ((uint32_t)0x00000008) /* Filter bit 3 */
#define CAN_F1B1_FBC4  ((uint32_t)0x00000010) /* Filter bit 4 */
#define CAN_F1B1_FBC5  ((uint32_t)0x00000020) /* Filter bit 5 */
#define CAN_F1B1_FBC6  ((uint32_t)0x00000040) /* Filter bit 6 */
#define CAN_F1B1_FBC7  ((uint32_t)0x00000080) /* Filter bit 7 */
#define CAN_F1B1_FBC8  ((uint32_t)0x00000100) /* Filter bit 8 */
#define CAN_F1B1_FBC9  ((uint32_t)0x00000200) /* Filter bit 9 */
#define CAN_F1B1_FBC10 ((uint32_t)0x00000400) /* Filter bit 10 */
#define CAN_F1B1_FBC11 ((uint32_t)0x00000800) /* Filter bit 11 */
#define CAN_F1B1_FBC12 ((uint32_t)0x00001000) /* Filter bit 12 */
#define CAN_F1B1_FBC13 ((uint32_t)0x00002000) /* Filter bit 13 */
#define CAN_F1B1_FBC14 ((uint32_t)0x00004000) /* Filter bit 14 */
#define CAN_F1B1_FBC15 ((uint32_t)0x00008000) /* Filter bit 15 */
#define CAN_F1B1_FBC16 ((uint32_t)0x00010000) /* Filter bit 16 */
#define CAN_F1B1_FBC17 ((uint32_t)0x00020000) /* Filter bit 17 */
#define CAN_F1B1_FBC18 ((uint32_t)0x00040000) /* Filter bit 18 */
#define CAN_F1B1_FBC19 ((uint32_t)0x00080000) /* Filter bit 19 */
#define CAN_F1B1_FBC20 ((uint32_t)0x00100000) /* Filter bit 20 */
#define CAN_F1B1_FBC21 ((uint32_t)0x00200000) /* Filter bit 21 */
#define CAN_F1B1_FBC22 ((uint32_t)0x00400000) /* Filter bit 22 */
#define CAN_F1B1_FBC23 ((uint32_t)0x00800000) /* Filter bit 23 */
#define CAN_F1B1_FBC24 ((uint32_t)0x01000000) /* Filter bit 24 */
#define CAN_F1B1_FBC25 ((uint32_t)0x02000000) /* Filter bit 25 */
#define CAN_F1B1_FBC26 ((uint32_t)0x04000000) /* Filter bit 26 */
#define CAN_F1B1_FBC27 ((uint32_t)0x08000000) /* Filter bit 27 */
#define CAN_F1B1_FBC28 ((uint32_t)0x10000000) /* Filter bit 28 */
#define CAN_F1B1_FBC29 ((uint32_t)0x20000000) /* Filter bit 29 */
#define CAN_F1B1_FBC30 ((uint32_t)0x40000000) /* Filter bit 30 */
#define CAN_F1B1_FBC31 ((uint32_t)0x80000000) /* Filter bit 31 */

/** Bit definition for CAN_F2R1 register **/
#define CAN_F2B1_FBC0  ((uint32_t)0x00000001) /* Filter bit 0 */
#define CAN_F2B1_FBC1  ((uint32_t)0x00000002) /* Filter bit 1 */
#define CAN_F2B1_FBC2  ((uint32_t)0x00000004) /* Filter bit 2 */
#define CAN_F2B1_FBC3  ((uint32_t)0x00000008) /* Filter bit 3 */
#define CAN_F2B1_FBC4  ((uint32_t)0x00000010) /* Filter bit 4 */
#define CAN_F2B1_FBC5  ((uint32_t)0x00000020) /* Filter bit 5 */
#define CAN_F2B1_FBC6  ((uint32_t)0x00000040) /* Filter bit 6 */
#define CAN_F2B1_FBC7  ((uint32_t)0x00000080) /* Filter bit 7 */
#define CAN_F2B1_FBC8  ((uint32_t)0x00000100) /* Filter bit 8 */
#define CAN_F2B1_FBC9  ((uint32_t)0x00000200) /* Filter bit 9 */
#define CAN_F2B1_FBC10 ((uint32_t)0x00000400) /* Filter bit 10 */
#define CAN_F2B1_FBC11 ((uint32_t)0x00000800) /* Filter bit 11 */
#define CAN_F2B1_FBC12 ((uint32_t)0x00001000) /* Filter bit 12 */
#define CAN_F2B1_FBC13 ((uint32_t)0x00002000) /* Filter bit 13 */
#define CAN_F2B1_FBC14 ((uint32_t)0x00004000) /* Filter bit 14 */
#define CAN_F2B1_FBC15 ((uint32_t)0x00008000) /* Filter bit 15 */
#define CAN_F2B1_FBC16 ((uint32_t)0x00010000) /* Filter bit 16 */
#define CAN_F2B1_FBC17 ((uint32_t)0x00020000) /* Filter bit 17 */
#define CAN_F2B1_FBC18 ((uint32_t)0x00040000) /* Filter bit 18 */
#define CAN_F2B1_FBC19 ((uint32_t)0x00080000) /* Filter bit 19 */
#define CAN_F2B1_FBC20 ((uint32_t)0x00100000) /* Filter bit 20 */
#define CAN_F2B1_FBC21 ((uint32_t)0x00200000) /* Filter bit 21 */
#define CAN_F2B1_FBC22 ((uint32_t)0x00400000) /* Filter bit 22 */
#define CAN_F2B1_FBC23 ((uint32_t)0x00800000) /* Filter bit 23 */
#define CAN_F2B1_FBC24 ((uint32_t)0x01000000) /* Filter bit 24 */
#define CAN_F2B1_FBC25 ((uint32_t)0x02000000) /* Filter bit 25 */
#define CAN_F2B1_FBC26 ((uint32_t)0x04000000) /* Filter bit 26 */
#define CAN_F2B1_FBC27 ((uint32_t)0x08000000) /* Filter bit 27 */
#define CAN_F2B1_FBC28 ((uint32_t)0x10000000) /* Filter bit 28 */
#define CAN_F2B1_FBC29 ((uint32_t)0x20000000) /* Filter bit 29 */
#define CAN_F2B1_FBC30 ((uint32_t)0x40000000) /* Filter bit 30 */
#define CAN_F2B1_FBC31 ((uint32_t)0x80000000) /* Filter bit 31 */

