SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for CAN_F9R1 register **/
#define CAN_F9B1_FBC0  ((uint32_t)0x00000001) /* Filter bit 0 */
#define CAN_F9B1_FBC1  ((uint32_t)0x00000002) /* Filter bit 1 */
#define CAN_F9B1_FBC2  ((uint32_t)0x00000004) /* Filter bit 2 */
#define CAN_F9B1_FBC3  ((uint32_t)0x00000008) /* Filter bit 3 */
#define CAN_F9B1_FBC4  ((uint32_t)0x00000010) /* Filter bit 4 */
#define CAN_F9B1_FBC5  ((uint32_t)0x00000020) /* Filter bit 5 */
#define CAN_F9B1_FBC6  ((uint32_t)0x00000040) /* Filter bit 6 */
#define CAN_F9B1_FBC7  ((uint32_t)0x00000080) /* Filter bit 7 */
#define CAN_F9B1_FBC8  ((uint32_t)0x00000100) /* Filter bit 8 */
#define CAN_F9B1_FBC9  ((uint32_t)0x00000200) /* Filter bit 9 */
#define CAN_F9B1_FBC10 ((uint32_t)0x00000400) /* Filter bit 10 */
#define CAN_F9B1_FBC11 ((uint32_t)0x00000800) /* Filter bit 11 */
#define CAN_F9B1_FBC12 ((uint32_t)0x00001000) /* Filter bit 12 */
#define CAN_F9B1_FBC13 ((uint32_t)0x00002000) /* Filter bit 13 */
#define CAN_F9B1_FBC14 ((uint32_t)0x00004000) /* Filter bit 14 */
#define CAN_F9B1_FBC15 ((uint32_t)0x00008000) /* Filter bit 15 */
#define CAN_F9B1_FBC16 ((uint32_t)0x00010000) /* Filter bit 16 */
#define CAN_F9B1_FBC17 ((uint32_t)0x00020000) /* Filter bit 17 */
#define CAN_F9B1_FBC18 ((uint32_t)0x00040000) /* Filter bit 18 */
#define CAN_F9B1_FBC19 ((uint32_t)0x00080000) /* Filter bit 19 */
#define CAN_F9B1_FBC20 ((uint32_t)0x00100000) /* Filter bit 20 */
#define CAN_F9B1_FBC21 ((uint32_t)0x00200000) /* Filter bit 21 */
#define CAN_F9B1_FBC22 ((uint32_t)0x00400000) /* Filter bit 22 */
#define CAN_F9B1_FBC23 ((uint32_t)0x00800000) /* Filter bit 23 */
#define CAN_F9B1_FBC24 ((uint32_t)0x01000000) /* Filter bit 24 */
#define CAN_F9B1_FBC25 ((uint32_t)0x02000000) /* Filter bit 25 */
#define CAN_F9B1_FBC26 ((uint32_t)0x04000000) /* Filter bit 26 */
#define CAN_F9B1_FBC27 ((uint32_t)0x08000000) /* Filter bit 27 */
#define CAN_F9B1_FBC28 ((uint32_t)0x10000000) /* Filter bit 28 */
#define CAN_F9B1_FBC29 ((uint32_t)0x20000000) /* Filter bit 29 */
#define CAN_F9B1_FBC30 ((uint32_t)0x40000000) /* Filter bit 30 */
#define CAN_F9B1_FBC31 ((uint32_t)0x80000000) /* Filter bit 31 */

/** Bit definition for CAN_F10R1 register **/
#define CAN_F10B1_FBC0  ((uint32_t)0x00000001) /* Filter bit 0 */
#define CAN_F10B1_FBC1  ((uint32_t)0x00000002) /* Filter bit 1 */
#define CAN_F10B1_FBC2  ((uint32_t)0x00000004) /* Filter bit 2 */
#define CAN_F10B1_FBC3  ((uint32_t)0x00000008) /* Filter bit 3 */
#define CAN_F10B1_FBC4  ((uint32_t)0x00000010) /* Filter bit 4 */
#define CAN_F10B1_FBC5  ((uint32_t)0x00000020) /* Filter bit 5 */
#define CAN_F10B1_FBC6  ((uint32_t)0x00000040) /* Filter bit 6 */
#define CAN_F10B1_FBC7  ((uint32_t)0x00000080) /* Filter bit 7 */
#define CAN_F10B1_FBC8  ((uint32_t)0x00000100) /* Filter bit 8 */
#define CAN_F10B1_FBC9  ((uint32_t)0x00000200) /* Filter bit 9 */
#define CAN_F10B1_FBC10 ((uint32_t)0x00000400) /* Filter bit 10 */
#define CAN_F10B1_FBC11 ((uint32_t)0x00000800) /* Filter bit 11 */
#define CAN_F10B1_FBC12 ((uint32_t)0x00001000) /* Filter bit 12 */
#define CAN_F10B1_FBC13 ((uint32_t)0x00002000) /* Filter bit 13 */
#define CAN_F10B1_FBC14 ((uint32_t)0x00004000) /* Filter bit 14 */
#define CAN_F10B1_FBC15 ((uint32_t)0x00008000) /* Filter bit 15 */
#define CAN_F10B1_FBC16 ((uint32_t)0x00010000) /* Filter bit 16 */
#define CAN_F10B1_FBC17 ((uint32_t)0x00020000) /* Filter bit 17 */
#define CAN_F10B1_FBC18 ((uint32_t)0x00040000) /* Filter bit 18 */
#define CAN_F10B1_FBC19 ((uint32_t)0x00080000) /* Filter bit 19 */
#define CAN_F10B1_FBC20 ((uint32_t)0x00100000) /* Filter bit 20 */
#define CAN_F10B1_FBC21 ((uint32_t)0x00200000) /* Filter bit 21 */
#define CAN_F10B1_FBC22 ((uint32_t)0x00400000) /* Filter bit 22 */
#define CAN_F10B1_FBC23 ((uint32_t)0x00800000) /* Filter bit 23 */
#define CAN_F10B1_FBC24 ((uint32_t)0x01000000) /* Filter bit 24 */
#define CAN_F10B1_FBC25 ((uint32_t)0x02000000) /* Filter bit 25 */
#define CAN_F10B1_FBC26 ((uint32_t)0x04000000) /* Filter bit 26 */
#define CAN_F10B1_FBC27 ((uint32_t)0x08000000) /* Filter bit 27 */
#define CAN_F10B1_FBC28 ((uint32_t)0x10000000) /* Filter bit 28 */
#define CAN_F10B1_FBC29 ((uint32_t)0x20000000) /* Filter bit 29 */
#define CAN_F10B1_FBC30 ((uint32_t)0x40000000) /* Filter bit 30 */
#define CAN_F10B1_FBC31 ((uint32_t)0x80000000) /* Filter bit 31 */

/** Bit definition for CAN_F11R1 register **/
#define CAN_F11B1_FBC0  ((uint32_t)0x00000001) /* Filter bit 0 */
#define CAN_F11B1_FBC1  ((uint32_t)0x00000002) /* Filter bit 1 */
#define CAN_F11B1_FBC2  ((uint32_t)0x00000004) /* Filter bit 2 */
#define CAN_F11B1_FBC3  ((uint32_t)0x00000008) /* Filter bit 3 */
#define CAN_F11B1_FBC4  ((uint32_t)0x00000010) /* Filter bit 4 */
#define CAN_F11B1_FBC5  ((uint32_t)0x00000020) /* Filter bit 5 */
#define CAN_F11B1_FBC6  ((uint32_t)0x00000040) /* Filter bit 6 */
#define CAN_F11B1_FBC7  ((uint32_t)0x00000080) /* Filter bit 7 */
#define CAN_F11B1_FBC8  ((uint32_t)0x00000100) /* Filter bit 8 */
#define CAN_F11B1_FBC9  ((uint32_t)0x00000200) /* Filter bit 9 */
#define CAN_F11B1_FBC10 ((uint32_t)0x00000400) /* Filter bit 10 */
#define CAN_F11B1_FBC11 ((uint32_t)0x00000800) /* Filter bit 11 */
#define CAN_F11B1_FBC12 ((uint32_t)0x00001000) /* Filter bit 12 */
#define CAN_F11B1_FBC13 ((uint32_t)0x00002000) /* Filter bit 13 */
#define CAN_F11B1_FBC14 ((uint32_t)0x00004000) /* Filter bit 14 */
#define CAN_F11B1_FBC15 ((uint32_t)0x00008000) /* Filter bit 15 */
#define CAN_F11B1_FBC16 ((uint32_t)0x00010000) /* Filter bit 16 */
#define CAN_F11B1_FBC17 ((uint32_t)0x00020000) /* Filter bit 17 */
#define CAN_F11B1_FBC18 ((uint32_t)0x00040000) /* Filter bit 18 */
#define CAN_F11B1_FBC19 ((uint32_t)0x00080000) /* Filter bit 19 */
#define CAN_F11B1_FBC20 ((uint32_t)0x00100000) /* Filter bit 20 */
#define CAN_F11B1_FBC21 ((uint32_t)0x00200000) /* Filter bit 21 */
#define CAN_F11B1_FBC22 ((uint32_t)0x00400000) /* Filter bit 22 */
#define CAN_F11B1_FBC23 ((uint32_t)0x00800000) /* Filter bit 23 */
#define CAN_F11B1_FBC24 ((uint32_t)0x01000000) /* Filter bit 24 */
#define CAN_F11B1_FBC25 ((uint32_t)0x02000000) /* Filter bit 25 */
#define CAN_F11B1_FBC26 ((uint32_t)0x04000000) /* Filter bit 26 */
#define CAN_F11B1_FBC27 ((uint32_t)0x08000000) /* Filter bit 27 */
#define CAN_F11B1_FBC28 ((uint32_t)0x10000000) /* Filter bit 28 */
#define CAN_F11B1_FBC29 ((uint32_t)0x20000000) /* Filter bit 29 */
#define CAN_F11B1_FBC30 ((uint32_t)0x40000000) /* Filter bit 30 */
#define CAN_F11B1_FBC31 ((uint32_t)0x80000000) /* Filter bit 31 */

/** Bit definition for CAN_F12R1 register **/
#define CAN_F12B1_FBC0  ((uint32_t)0x00000001) /* Filter bit 0 */
#define CAN_F12B1_FBC1  ((uint32_t)0x00000002) /* Filter bit 1 */
#define CAN_F12B1_FBC2  ((uint32_t)0x00000004) /* Filter bit 2 */
#define CAN_F12B1_FBC3  ((uint32_t)0x00000008) /* Filter bit 3 */
#define CAN_F12B1_FBC4  ((uint32_t)0x00000010) /* Filter bit 4 */
#define CAN_F12B1_FBC5  ((uint32_t)0x00000020) /* Filter bit 5 */
#define CAN_F12B1_FBC6  ((uint32_t)0x00000040) /* Filter bit 6 */
#define CAN_F12B1_FBC7  ((uint32_t)0x00000080) /* Filter bit 7 */
#define CAN_F12B1_FBC8  ((uint32_t)0x00000100) /* Filter bit 8 */
#define CAN_F12B1_FBC9  ((uint32_t)0x00000200) /* Filter bit 9 */
#define CAN_F12B1_FBC10 ((uint32_t)0x00000400) /* Filter bit 10 */
#define CAN_F12B1_FBC11 ((uint32_t)0x00000800) /* Filter bit 11 */
#define CAN_F12B1_FBC12 ((uint32_t)0x00001000) /* Filter bit 12 */
#define CAN_F12B1_FBC13 ((uint32_t)0x00002000) /* Filter bit 13 */
#define CAN_F12B1_FBC14 ((uint32_t)0x00004000) /* Filter bit 14 */
#define CAN_F12B1_FBC15 ((uint32_t)0x00008000) /* Filter bit 15 */
#define CAN_F12B1_FBC16 ((uint32_t)0x00010000) /* Filter bit 16 */
#define CAN_F12B1_FBC17 ((uint32_t)0x00020000) /* Filter bit 17 */
#define CAN_F12B1_FBC18 ((uint32_t)0x00040000) /* Filter bit 18 */
#define CAN_F12B1_FBC19 ((uint32_t)0x00080000) /* Filter bit 19 */
#define CAN_F12B1_FBC20 ((uint32_t)0x00100000) /* Filter bit 20 */
#define CAN_F12B1_FBC21 ((uint32_t)0x00200000) /* Filter bit 21 */
#define CAN_F12B1_FBC22 ((uint32_t)0x00400000) /* Filter bit 22 */
#define CAN_F12B1_FBC23 ((uint32_t)0x00800000) /* Filter bit 23 */
#define CAN_F12B1_FBC24 ((uint32_t)0x01000000) /* Filter bit 24 */
#define CAN_F12B1_FBC25 ((uint32_t)0x02000000) /* Filter bit 25 */
#define CAN_F12B1_FBC26 ((uint32_t)0x04000000) /* Filter bit 26 */
#define CAN_F12B1_FBC27 ((uint32_t)0x08000000) /* Filter bit 27 */
#define CAN_F12B1_FBC28 ((uint32_t)0x10000000) /* Filter bit 28 */
#define CAN_F12B1_FBC29 ((uint32_t)0x20000000) /* Filter bit 29 */
#define CAN_F12B1_FBC30 ((uint32_t)0x40000000) /* Filter bit 30 */
#define CAN_F12B1_FBC31 ((uint32_t)0x80000000) /* Filter bit 31 */

