SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
#define USART_CTRL2_LINMEN ((uint16_t)0x4000) /* LIN mode enable */

/** Bit definition for USART_CTRL3 register **/
#define USART_CTRL3_ERRIEN  ((uint16_t)0x0001) /* Error Interrupt Enable */
#define USART_CTRL3_IRDAMEN ((uint16_t)0x0002) /* IrDA mode Enable */
#define USART_CTRL3_IRDALP  ((uint16_t)0x0004) /* IrDA Low-Power */
#define USART_CTRL3_HDMEN   ((uint16_t)0x0008) /* Half-Duplex Selection */
#define USART_CTRL3_SCNACK  ((uint16_t)0x0010) /* Smartcard NACK enable */
#define USART_CTRL3_SCMEN   ((uint16_t)0x0020) /* Smartcard mode enable */
#define USART_CTRL3_DMARXEN ((uint16_t)0x0040) /* DMA Enable Receiver */
#define USART_CTRL3_DMATXEN ((uint16_t)0x0080) /* DMA Enable Transmitter */
#define USART_CTRL3_RTSEN   ((uint16_t)0x0100) /* RTS Enable */
#define USART_CTRL3_CTSEN   ((uint16_t)0x0200) /* CTS Enable */
#define USART_CTRL3_CTSIEN  ((uint16_t)0x0400) /* CTS Interrupt Enable */

/** Bit definition for USART_GTP register **/
#define USART_GTP_PSCV   ((uint16_t)0x00FF) /* PSC[7:0] bits (Prescaler value) */
#define USART_GTP_PSCV_0 ((uint16_t)0x0001) /* Bit 0 */
#define USART_GTP_PSCV_1 ((uint16_t)0x0002) /* Bit 1 */
#define USART_GTP_PSCV_2 ((uint16_t)0x0004) /* Bit 2 */
#define USART_GTP_PSCV_3 ((uint16_t)0x0008) /* Bit 3 */
#define USART_GTP_PSCV_4 ((uint16_t)0x0010) /* Bit 4 */
#define USART_GTP_PSCV_5 ((uint16_t)0x0020) /* Bit 5 */
#define USART_GTP_PSCV_6 ((uint16_t)0x0040) /* Bit 6 */
#define USART_GTP_PSCV_7 ((uint16_t)0x0080) /* Bit 7 */

#define USART_GTP_GTV ((uint16_t)0xFF00) /* Guard time value */


/*** Debug MCU ***/

/** Bit definition for DBG_ID register **/
#define DBG_ID_DEV    ((uint32_t)0x00000FFF) /* Device Identifier */

#define DBG_ID_REV    ((uint32_t)0xFFFF0000) /* REV_ID[15:0] bits (Revision Identifier) */
#define DBG_ID_REV_0  ((uint32_t)0x00010000) /* Bit 0 */
#define DBG_ID_REV_1  ((uint32_t)0x00020000) /* Bit 1 */
#define DBG_ID_REV_2  ((uint32_t)0x00040000) /* Bit 2 */
#define DBG_ID_REV_3  ((uint32_t)0x00080000) /* Bit 3 */
#define DBG_ID_REV_4  ((uint32_t)0x00100000) /* Bit 4 */
#define DBG_ID_REV_5  ((uint32_t)0x00200000) /* Bit 5 */
#define DBG_ID_REV_6  ((uint32_t)0x00400000) /* Bit 6 */
#define DBG_ID_REV_7  ((uint32_t)0x00800000) /* Bit 7 */
#define DBG_ID_REV_8  ((uint32_t)0x01000000) /* Bit 8 */
#define DBG_ID_REV_9  ((uint32_t)0x02000000) /* Bit 9 */
#define DBG_ID_REV_10 ((uint32_t)0x04000000) /* Bit 10 */
#define DBG_ID_REV_11 ((uint32_t)0x08000000) /* Bit 11 */
#define DBG_ID_REV_12 ((uint32_t)0x10000000) /* Bit 12 */
#define DBG_ID_REV_13 ((uint32_t)0x20000000) /* Bit 13 */
#define DBG_ID_REV_14 ((uint32_t)0x40000000) /* Bit 14 */
#define DBG_ID_REV_15 ((uint32_t)0x80000000) /* Bit 15 */

/** Bit definition for DBG_CTRL register **/
#define DBG_CTRL_SLEEP        ((uint32_t)0x00000001) /* Debug Sleep Mode */
#define DBG_CTRL_STOP         ((uint32_t)0x00000002) /* Debug Stop Mode */
#define DBG_CTRL_STDBY        ((uint32_t)0x00000004) /* Debug Standby mode */

#define DBG_CTRL_IWDG_STOP    ((uint32_t)0x00000100) /* Debug Independent Watchdog stopped when Core is halted */
#define DBG_CTRL_WWDG_STOP    ((uint32_t)0x00000200) /* Debug Window Watchdog stopped when Core is halted */
#define DBG_CTRL_TIM1_STOP    ((uint32_t)0x00000400) /* TIM1 counter stopped when core is halted */
#define DBG_CTRL_TIM2_STOP    ((uint32_t)0x00000800) /* TIM2 counter stopped when core is halted */
#define DBG_CTRL_TIM3_STOP    ((uint32_t)0x00001000) /* TIM3 counter stopped when core is halted */
#define DBG_CTRL_TIM4_STOP    ((uint32_t)0x00002000) /* TIM4 counter stopped when core is halted */
#define DBG_CTRL_CAN_STOP     ((uint32_t)0x00004000) /* Debug CAN stopped when Core is halted */
#define DBG_CTRL_I2C1SMBUS_TO ((uint32_t)0x00008000) /* SMBUS I2C1 timeout mode stopped when Core is halted */
#define DBG_CTRL_I2C2SMBUS_TO ((uint32_t)0x00010000) /* SMBUS I2C2 timeout mode stopped when Core is halted */
#define DBG_CTRL_TIM8_STOP    ((uint32_t)0x00020000) /* TIM8 counter stopped when core is halted */
#define DBG_CTRL_TIM5_STOP    ((uint32_t)0x00040000) /* TIM5 counter stopped when core is halted */
#define DBG_CTRL_TIM6_STOP    ((uint32_t)0x00080000) /* TIM6 counter stopped when core is halted */


/*** BEEPER Register ***/

/** Bit definition for BEEPER_CTRL register **/
#define BEERPER_CTRL_BEEPEN     ((uint32_t)0x00000001)  /* Bit[0] */
#define BEERPER_CTRL_INVEN      ((uint32_t)0x00000002)  /* Bit[1] */

#define BEEPER_CTRL_CLKSEL      ((uint32_t)0x0000000C)  /* Clock source selection */
#define BEEPER_CTRL_CLKSEL_0    ((uint32_t)0x00000004)  /* Bit[0] */
#define BEEPER_CTRL_CLKSEL_1    ((uint32_t)0x00000008)  /* Bit[1] */

#define BEEPER_CTRL_BEEPDIV     ((uint32_t)0x000001FF0) /* Beeper divide factor */
#define BEEPER_CTRL_BEEPDIV_0   ((uint32_t)0x00000010)  /* Bit[0] */
#define BEEPER_CTRL_BEEPDIV_1   ((uint32_t)0x00000020)  /* Bit[1] */
#define BEEPER_CTRL_BEEPDIV_2   ((uint32_t)0x00000040)  /* Bit[2] */
#define BEEPER_CTRL_BEEPDIV_3   ((uint32_t)0x00000080)  /* Bit[3] */
#define BEEPER_CTRL_BEEPDIV_4   ((uint32_t)0x00000100)  /* Bit[4] */
#define BEEPER_CTRL_BEEPDIV_5   ((uint32_t)0x00000200)  /* Bit[5] */
#define BEEPER_CTRL_BEEPDIV_6   ((uint32_t)0x00000400)  /* Bit[6] */
#define BEEPER_CTRL_BEEPDIV_7   ((uint32_t)0x00000800)  /* Bit[7] */
#define BEEPER_CTRL_BEEPDIV_8   ((uint32_t)0x00001000)  /* Bit[8] */

#define BEEPER_CTRL_BYPASSEN    ((uint32_t)0x00008000)  /* Bypass at second stage with select clock signal */

#define BEEPER_CTRL_PSC         ((uint32_t)0x003F0000)  /* APB clock prescale factor */
#define BEEPER_CTRL_PSC_0       ((uint32_t)0x00010000)  /* Bit[0] */
#define BEEPER_CTRL_PSC_1       ((uint32_t)0x00020000)  /* Bit[1] */
#define BEEPER_CTRL_PSC_2       ((uint32_t)0x00040000)  /* Bit[2] */
#define BEEPER_CTRL_PSC_3       ((uint32_t)0x00080000)  /* Bit[3] */
#define BEEPER_CTRL_PSC_4       ((uint32_t)0x00100000)  /* Bit[4] */
#define BEEPER_CTRL_PSC_5       ((uint32_t)0x00200000)  /* Bit[5] */


/*** FLASH and Option Bytes Registers ***/

/** Bit definition for FLASH_AC register **/
#define FLASH_AC_LATENCY   ((uint8_t)0x07) /* LATENCY[2:0] bits (Latency) */
#define FLASH_AC_LATENCY_0 ((uint8_t)0x00) /* Bit 0 = 0 */
#define FLASH_AC_LATENCY_1 ((uint8_t)0x01) /* Bit 0 = 1 */
#define FLASH_AC_LATENCY_2 ((uint8_t)0x02) /* Bit 0 = 0; Bit 1 = 1 */
#define FLASH_AC_LATENCY_3 ((uint8_t)0x03) /* Bit 0 = 1; Bit 1 = 1 */
#define FLASH_AC_LATENCY_4 ((uint8_t)0x04) /* Bit 0 = 0; Bit 1 = 0; Bit 2 = 1 */

#define FLASH_AC_PRFTBFEN  ((uint8_t)0x10) /* Prefetch Buffer Enable */
#define FLASH_AC_PRFTBFSTS ((uint8_t)0x20) /* Prefetch Buffer Status */
#define FLASH_AC_ICAHRST   ((uint8_t)0x40) /* Icache Reset */
#define FLASH_AC_ICAHEN    ((uint8_t)0x80) /* Icache Enable */

