SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for AFIO_RMP_CFG register **/
#define AFIO_RMP_CFG_EXTI_ETRR     ((uint16_t)0x000F)  /* AFIO_RMP_CFG bit (0..3) */
#define AFIO_RMP_CFG_EXTI_ETRI     ((uint16_t)0x00F0)  /* AFIO_RMP_CFG bit (4..7) */
#define AFIO_RMP_CFG_ADC_ETRR      ((uint16_t)0x0100)  /* AFIO_RMP_CFG bit 8 */
#define AFIO_RMP_CFG_ADC_ETRI      ((uint16_t)0x0200)  /* AFIO_RMP_CFG bit 9 */
#define AFIO_RMP_CFG_SPI2_NSS      ((uint16_t)0x0400)  /* AFIO_RMP_CFG bit 10 */
#define AFIO_RMP_CFG_SPI1_NSS      ((uint16_t)0x0800)  /* AFIO_RMP_CFG bit 11 */

/** Bit definition for AFIO_EXTI_CFG1 register **/
#define AFIO_EXTI_CFG1_EXTI0       ((uint32_t)0x0000003F)  /* EXTI 0 configuration */
#define AFIO_EXTI_CFG1_EXTI1       ((uint32_t)0x00003F00)  /* EXTI 1 configuration */
#define AFIO_EXTI_CFG1_EXTI2       ((uint32_t)0x003F0000)  /* EXTI 2 configuration */
#define AFIO_EXTI_CFG1_EXTI3       ((uint32_t)0x3F000000)  /* EXTI 3 configuration */

/** EXTI0 configuration **/
#define AFIO_EXTI_CFG1_EXTI0_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB0   ((uint32_t)0x00000001) /* PB[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PD0   ((uint32_t)0x00000003) /* PD[0] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA1   ((uint32_t)0x00000004) /* PA[1] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB1   ((uint32_t)0x00000005) /* PB[1] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA2   ((uint32_t)0x00000008) /* PA[2] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB2   ((uint32_t)0x00000009) /* PB[2] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA3   ((uint32_t)0x0000000C) /* PA[3] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB3   ((uint32_t)0x0000000D) /* PB[3] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA4   ((uint32_t)0x00000010) /* PA[4] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB4   ((uint32_t)0x00000011) /* PB[4] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA5   ((uint32_t)0x00000014) /* PA[5] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB5   ((uint32_t)0x00000015) /* PB[5] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA6   ((uint32_t)0x00000018) /* PA[6] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB6   ((uint32_t)0x00000019) /* PB[6] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA7   ((uint32_t)0x0000001C) /* PA[7] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB7   ((uint32_t)0x0000001D) /* PB[7] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA8   ((uint32_t)0x00000020) /* PA[8] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB8   ((uint32_t)0x00000021) /* PB[8] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA9   ((uint32_t)0x00000024) /* PA[9] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB9   ((uint32_t)0x00000025) /* PB[9] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA10  ((uint32_t)0x00000028) /* PA[10] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB10  ((uint32_t)0x00000029) /* PB[10] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA11  ((uint32_t)0x0000002C) /* PA[11] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB11  ((uint32_t)0x0000002D) /* PB[11] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA12  ((uint32_t)0x00000030) /* PA[12] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB12  ((uint32_t)0x00000031) /* PB[12] pin */
#define AFIO_EXTI_CFG1_EXTI0_PD12  ((uint32_t)0x00000033) /* PD[12] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA13  ((uint32_t)0x00000034) /* PA[13] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB13  ((uint32_t)0x00000035) /* PB[13] pin */
#define AFIO_EXTI_CFG1_EXTI0_PC13  ((uint32_t)0x00000036) /* PC[13] pin */
#define AFIO_EXTI_CFG1_EXTI0_PD13  ((uint32_t)0x00000037) /* PD[13] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA14  ((uint32_t)0x00000038) /* PA[14] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB14  ((uint32_t)0x00000039) /* PB[14] pin */
#define AFIO_EXTI_CFG1_EXTI0_PC14  ((uint32_t)0x0000003A) /* PC[14] pin */
#define AFIO_EXTI_CFG1_EXTI0_PD14  ((uint32_t)0x0000003B) /* PD[14] pin */
#define AFIO_EXTI_CFG1_EXTI0_PA15  ((uint32_t)0x0000003C) /* PA[15] pin */
#define AFIO_EXTI_CFG1_EXTI0_PB15  ((uint32_t)0x0000003D) /* PB[15] pin */
#define AFIO_EXTI_CFG1_EXTI0_PC15  ((uint32_t)0x0000003E) /* PC[15] pin */
#define AFIO_EXTI_CFG1_EXTI0_PD15  ((uint32_t)0x0000003F) /* PD[15] pin */

/** EXTI1 configuration **/
#define AFIO_EXTI_CFG1_EXTI1_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB0   ((uint32_t)0x00000100) /* PB[0] pin */
#define AFIO_EXTI_CFG1_EXTI1_PD0   ((uint32_t)0x00000300) /* PD[0] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA1   ((uint32_t)0x00000400) /* PA[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB1   ((uint32_t)0x00000500) /* PB[1] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA2   ((uint32_t)0x00000800) /* PA[2] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB2   ((uint32_t)0x00000900) /* PB[2] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA3   ((uint32_t)0x00000C00) /* PA[3] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB3   ((uint32_t)0x00000D00) /* PB[3] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA4   ((uint32_t)0x00001000) /* PA[4] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB4   ((uint32_t)0x00001100) /* PB[4] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA5   ((uint32_t)0x00001400) /* PA[5] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB5   ((uint32_t)0x00001500) /* PB[5] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA6   ((uint32_t)0x00001800) /* PA[6] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB6   ((uint32_t)0x00001900) /* PB[6] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA7   ((uint32_t)0x00001C00) /* PA[7] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB7   ((uint32_t)0x00001D00) /* PB[7] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA8   ((uint32_t)0x00002000) /* PA[8] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB8   ((uint32_t)0x00002100) /* PB[8] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA9   ((uint32_t)0x00002400) /* PA[9] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB9   ((uint32_t)0x00002500) /* PB[9] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA10  ((uint32_t)0x00002800) /* PA[10] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB10  ((uint32_t)0x00002900) /* PB[10] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA11  ((uint32_t)0x00002C00) /* PA[11] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB11  ((uint32_t)0x00002D00) /* PB[11] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA12  ((uint32_t)0x00003000) /* PA[12] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB12  ((uint32_t)0x00003100) /* PB[12] pin */
#define AFIO_EXTI_CFG1_EXTI1_PD12  ((uint32_t)0x00003300) /* PD[12] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA13  ((uint32_t)0x00003400) /* PA[13] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB13  ((uint32_t)0x00003500) /* PB[13] pin */
#define AFIO_EXTI_CFG1_EXTI1_PC13  ((uint32_t)0x00003600) /* PC[13] pin */
#define AFIO_EXTI_CFG1_EXTI1_PD13  ((uint32_t)0x00003700) /* PD[13] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA14  ((uint32_t)0x00003800) /* PA[14] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB14  ((uint32_t)0x00003900) /* PB[14] pin */
#define AFIO_EXTI_CFG1_EXTI1_PC14  ((uint32_t)0x00003A00) /* PC[14] pin */
#define AFIO_EXTI_CFG1_EXTI1_PD14  ((uint32_t)0x00003B00) /* PD[14] pin */
#define AFIO_EXTI_CFG1_EXTI1_PA15  ((uint32_t)0x00003C00) /* PA[15] pin */
#define AFIO_EXTI_CFG1_EXTI1_PB15  ((uint32_t)0x00003D00) /* PB[15] pin */
#define AFIO_EXTI_CFG1_EXTI1_PC15  ((uint32_t)0x00003E00) /* PC[15] pin */
#define AFIO_EXTI_CFG1_EXTI1_PD15  ((uint32_t)0x00003F00) /* PD[15] pin */

/** EXTI2 configuration **/
#define AFIO_EXTI_CFG1_EXTI2_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB0   ((uint32_t)0x00010000) /* PB[0] pin */
#define AFIO_EXTI_CFG1_EXTI2_PD0   ((uint32_t)0x00030000) /* PD[0] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA1   ((uint32_t)0x00040000) /* PA[1] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB1   ((uint32_t)0x00050000) /* PB[1] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA2   ((uint32_t)0x00080000) /* PA[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB2   ((uint32_t)0x00090000) /* PB[2] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA3   ((uint32_t)0x000C0000) /* PA[3] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB3   ((uint32_t)0x000D0000) /* PB[3] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA4   ((uint32_t)0x00100000) /* PA[4] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB4   ((uint32_t)0x00110000) /* PB[4] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA5   ((uint32_t)0x00140000) /* PA[5] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB5   ((uint32_t)0x00150000) /* PB[5] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA6   ((uint32_t)0x00180000) /* PA[6] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB6   ((uint32_t)0x00190000) /* PB[6] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA7   ((uint32_t)0x001C0000) /* PA[7] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB7   ((uint32_t)0x001D0000) /* PB[7] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA8   ((uint32_t)0x00200000) /* PA[8] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB8   ((uint32_t)0x00210000) /* PB[8] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA9   ((uint32_t)0x00240000) /* PA[9] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB9   ((uint32_t)0x00250000) /* PB[9] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA10  ((uint32_t)0x00280000) /* PA[10] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB10  ((uint32_t)0x00290000) /* PB[10] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA11  ((uint32_t)0x002C0000) /* PA[11] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB11  ((uint32_t)0x002D0000) /* PB[11] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA12  ((uint32_t)0x00300000) /* PA[12] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB12  ((uint32_t)0x00310000) /* PB[12] pin */
#define AFIO_EXTI_CFG1_EXTI2_PD12  ((uint32_t)0x00330000) /* PD[12] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA13  ((uint32_t)0x00340000) /* PA[13] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB13  ((uint32_t)0x00350000) /* PB[13] pin */
#define AFIO_EXTI_CFG1_EXTI2_PC13  ((uint32_t)0x00360000) /* PC[13] pin */
#define AFIO_EXTI_CFG1_EXTI2_PD13  ((uint32_t)0x00370000) /* PD[13] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA14  ((uint32_t)0x00380000) /* PA[14] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB14  ((uint32_t)0x00390000) /* PB[14] pin */
#define AFIO_EXTI_CFG1_EXTI2_PC14  ((uint32_t)0x003A0000) /* PC[14] pin */
#define AFIO_EXTI_CFG1_EXTI2_PD14  ((uint32_t)0x003B0000) /* PD[14] pin */
#define AFIO_EXTI_CFG1_EXTI2_PA15  ((uint32_t)0x003C0000) /* PA[15] pin */
#define AFIO_EXTI_CFG1_EXTI2_PB15  ((uint32_t)0x003D0000) /* PB[15] pin */
#define AFIO_EXTI_CFG1_EXTI2_PC15  ((uint32_t)0x003E0000) /* PC[15] pin */
#define AFIO_EXTI_CFG1_EXTI2_PD15  ((uint32_t)0x003F0000) /* PD[15] pin */

/** EXTI3 configuration **/
#define AFIO_EXTI_CFG1_EXTI3_PA0   ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB0   ((uint32_t)0x01000000) /* PB[0] pin */
#define AFIO_EXTI_CFG1_EXTI3_PD0   ((uint32_t)0x03000000) /* PD[0] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA1   ((uint32_t)0x04000000) /* PA[1] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB1   ((uint32_t)0x05000000) /* PB[1] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA2   ((uint32_t)0x08000000) /* PA[2] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB2   ((uint32_t)0x09000000) /* PB[2] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA3   ((uint32_t)0x0C000000) /* PA[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB3   ((uint32_t)0x0D000000) /* PB[3] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA4   ((uint32_t)0x10000000) /* PA[4] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB4   ((uint32_t)0x11000000) /* PB[4] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA5   ((uint32_t)0x14000000) /* PA[5] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB5   ((uint32_t)0x15000000) /* PB[5] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA6   ((uint32_t)0x18000000) /* PA[6] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB6   ((uint32_t)0x19000000) /* PB[6] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA7   ((uint32_t)0x1C000000) /* PA[7] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB7   ((uint32_t)0x1D000000) /* PB[7] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA8   ((uint32_t)0x20000000) /* PA[8] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB8   ((uint32_t)0x21000000) /* PB[8] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA9   ((uint32_t)0x24000000) /* PA[9] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB9   ((uint32_t)0x25000000) /* PB[9] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA10  ((uint32_t)0x28000000) /* PA[10] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB10  ((uint32_t)0x29000000) /* PB[10] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA11  ((uint32_t)0x2C000000) /* PA[11] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB11  ((uint32_t)0x2D000000) /* PB[11] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA12  ((uint32_t)0x30000000) /* PA[12] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB12  ((uint32_t)0x31000000) /* PB[12] pin */
#define AFIO_EXTI_CFG1_EXTI3_PD12  ((uint32_t)0x33000000) /* PD[12] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA13  ((uint32_t)0x34000000) /* PA[13] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB13  ((uint32_t)0x35000000) /* PB[13] pin */
#define AFIO_EXTI_CFG1_EXTI3_PC13  ((uint32_t)0x36000000) /* PC[13] pin */
#define AFIO_EXTI_CFG1_EXTI3_PD13  ((uint32_t)0x37000000) /* PD[13] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA14  ((uint32_t)0x38000000) /* PA[14] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB14  ((uint32_t)0x39000000) /* PB[14] pin */
#define AFIO_EXTI_CFG1_EXTI3_PC14  ((uint32_t)0x3A000000) /* PC[14] pin */
#define AFIO_EXTI_CFG1_EXTI3_PD14  ((uint32_t)0x3B000000) /* PD[14] pin */
#define AFIO_EXTI_CFG1_EXTI3_PA15  ((uint32_t)0x3C000000) /* PA[15] pin */
#define AFIO_EXTI_CFG1_EXTI3_PB15  ((uint32_t)0x3D000000) /* PB[15] pin */
#define AFIO_EXTI_CFG1_EXTI3_PC15  ((uint32_t)0x3E000000) /* PC[15] pin */
#define AFIO_EXTI_CFG1_EXTI3_PD15  ((uint32_t)0x3F000000) /* PD[15] pin */

/** Bit definition for AFIO_EXTI_CFG2 register **/
#define AFIO_EXTI_CFG2_EXTI4       ((uint32_t)0x0000003F) /* EXTI 4 configuration */
#define AFIO_EXTI_CFG2_EXTI5       ((uint32_t)0x00003F00) /* EXTI 5 configuration */
#define AFIO_EXTI_CFG2_EXTI6       ((uint32_t)0x003F0000) /* EXTI 6 configuration */
#define AFIO_EXTI_CFG2_EXTI7       ((uint32_t)0x3F000000) /* EXTI 7 configuration */

