SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** EXTI11 configuration **/
#define AFIO_EXTI_CFG3_EXTI11_PA0  ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB0  ((uint32_t)0x01000000) /* PB[0] pin */
#define AFIO_EXTI_CFG3_EXTI11_PD0  ((uint32_t)0x03000000) /* PD[0] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA1  ((uint32_t)0x04000000) /* PA[1] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB1  ((uint32_t)0x05000000) /* PB[1] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA2  ((uint32_t)0x08000000) /* PA[2] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB2  ((uint32_t)0x09000000) /* PB[2] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA3  ((uint32_t)0x0C000000) /* PA[3] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB3  ((uint32_t)0x0D000000) /* PB[3] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA4  ((uint32_t)0x10000000) /* PA[4] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB4  ((uint32_t)0x11000000) /* PB[4] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA5  ((uint32_t)0x14000000) /* PA[5] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB5  ((uint32_t)0x15000000) /* PB[5] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA6  ((uint32_t)0x18000000) /* PA[6] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB6  ((uint32_t)0x19000000) /* PB[6] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA7  ((uint32_t)0x1C000000) /* PA[7] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB7  ((uint32_t)0x1D000000) /* PB[7] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA8  ((uint32_t)0x20000000) /* PA[8] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB8  ((uint32_t)0x21000000) /* PB[8] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA9  ((uint32_t)0x24000000) /* PA[9] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB9  ((uint32_t)0x25000000) /* PB[9] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA10 ((uint32_t)0x28000000) /* PA[10] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB10 ((uint32_t)0x29000000) /* PB[10] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA11 ((uint32_t)0x2C000000) /* PA[11] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB11 ((uint32_t)0x2D000000) /* PB[11] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA12 ((uint32_t)0x30000000) /* PA[12] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB12 ((uint32_t)0x31000000) /* PB[12] pin */
#define AFIO_EXTI_CFG3_EXTI11_PD12 ((uint32_t)0x33000000) /* PD[12] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA13 ((uint32_t)0x34000000) /* PA[13] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB13 ((uint32_t)0x35000000) /* PB[13] pin */
#define AFIO_EXTI_CFG3_EXTI11_PC13 ((uint32_t)0x36000000) /* PC[13] pin */
#define AFIO_EXTI_CFG3_EXTI11_PD13 ((uint32_t)0x37000000) /* PD[13] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA14 ((uint32_t)0x38000000) /* PA[14] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB14 ((uint32_t)0x39000000) /* PB[14] pin */
#define AFIO_EXTI_CFG3_EXTI11_PC14 ((uint32_t)0x3A000000) /* PC[14] pin */
#define AFIO_EXTI_CFG3_EXTI11_PD14 ((uint32_t)0x3B000000) /* PD[14] pin */
#define AFIO_EXTI_CFG3_EXTI11_PA15 ((uint32_t)0x3C000000) /* PA[15] pin */
#define AFIO_EXTI_CFG3_EXTI11_PB15 ((uint32_t)0x3D000000) /* PB[15] pin */
#define AFIO_EXTI_CFG3_EXTI11_PC15 ((uint32_t)0x3E000000) /* PC[15] pin */
#define AFIO_EXTI_CFG3_EXTI11_PD15 ((uint32_t)0x3F000000) /* PD[15] pin */

/** Bit definition for AFIO_EXTI_CFG4 register **/
#define AFIO_EXTI_CFG4_EXTI12      ((uint32_t)0x0000003F) /* EXTI 12 configuration */
#define AFIO_EXTI_CFG4_EXTI13      ((uint32_t)0x00003F00) /* EXTI 13 configuration */
#define AFIO_EXTI_CFG4_EXTI14      ((uint32_t)0x003F0000)  /* EXTI 14 configuration */
#define AFIO_EXTI_CFG4_EXTI15      ((uint32_t)0x3F000000)  /* EXTI 15 configuration */

/** EXTI12 configuration **/
#define AFIO_EXTI_CFG4_EXTI12_PA0  ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB0  ((uint32_t)0x00000001) /* PB[0] pin */
#define AFIO_EXTI_CFG4_EXTI12_PD0  ((uint32_t)0x00000003) /* PD[0] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA1  ((uint32_t)0x00000004) /* PA[1] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB1  ((uint32_t)0x00000005) /* PB[1] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA2  ((uint32_t)0x00000008) /* PA[2] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB2  ((uint32_t)0x00000009) /* PB[2] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA3  ((uint32_t)0x0000000C) /* PA[3] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB3  ((uint32_t)0x0000000D) /* PB[3] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA4  ((uint32_t)0x00000010) /* PA[4] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB4  ((uint32_t)0x00000011) /* PB[4] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA5  ((uint32_t)0x00000014) /* PA[5] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB5  ((uint32_t)0x00000015) /* PB[5] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA6  ((uint32_t)0x00000018) /* PA[6] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB6  ((uint32_t)0x00000019) /* PB[6] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA7  ((uint32_t)0x0000001C) /* PA[7] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB7  ((uint32_t)0x0000001D) /* PB[7] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA8  ((uint32_t)0x00000020) /* PA[8] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB8  ((uint32_t)0x00000021) /* PB[8] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA9  ((uint32_t)0x00000024) /* PA[9] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB9  ((uint32_t)0x00000025) /* PB[9] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA10 ((uint32_t)0x00000028) /* PA[10] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB10 ((uint32_t)0x00000029) /* PB[10] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA11 ((uint32_t)0x0000002C) /* PA[11] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB11 ((uint32_t)0x0000002D) /* PB[11] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA12 ((uint32_t)0x00000030) /* PA[12] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB12 ((uint32_t)0x00000031) /* PB[12] pin */
#define AFIO_EXTI_CFG4_EXTI12_PD12 ((uint32_t)0x00000033) /* PD[12] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA13 ((uint32_t)0x00000034) /* PA[13] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB13 ((uint32_t)0x00000035) /* PB[13] pin */
#define AFIO_EXTI_CFG4_EXTI12_PC13 ((uint32_t)0x00000036) /* PC[13] pin */
#define AFIO_EXTI_CFG4_EXTI12_PD13 ((uint32_t)0x00000037) /* PD[13] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA14 ((uint32_t)0x00000038) /* PA[14] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB14 ((uint32_t)0x00000039) /* PB[14] pin */
#define AFIO_EXTI_CFG4_EXTI12_PC14 ((uint32_t)0x0000003A) /* PC[14] pin */
#define AFIO_EXTI_CFG4_EXTI12_PD14 ((uint32_t)0x0000003B) /* PD[14] pin */
#define AFIO_EXTI_CFG4_EXTI12_PA15 ((uint32_t)0x0000003C) /* PA[15] pin */
#define AFIO_EXTI_CFG4_EXTI12_PB15 ((uint32_t)0x0000003D) /* PB[15] pin */
#define AFIO_EXTI_CFG4_EXTI12_PC15 ((uint32_t)0x0000003E) /* PC[15] pin */
#define AFIO_EXTI_CFG4_EXTI12_PD15 ((uint32_t)0x0000003F) /* PD[15] pin */

/** EXTI13 configuration **/
#define AFIO_EXTI_CFG4_EXTI13_PA0  ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB0  ((uint32_t)0x00000100) /* PB[0] pin */
#define AFIO_EXTI_CFG4_EXTI13_PD0  ((uint32_t)0x00000300) /* PD[0] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA1  ((uint32_t)0x00000400) /* PA[1] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB1  ((uint32_t)0x00000500) /* PB[1] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA2  ((uint32_t)0x00000800) /* PA[2] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB2  ((uint32_t)0x00000900) /* PB[2] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA3  ((uint32_t)0x00000C00) /* PA[3] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB3  ((uint32_t)0x00000D00) /* PB[3] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA4  ((uint32_t)0x00001000) /* PA[4] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB4  ((uint32_t)0x00001100) /* PB[4] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA5  ((uint32_t)0x00001400) /* PA[5] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB5  ((uint32_t)0x00001500) /* PB[5] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA6  ((uint32_t)0x00001800) /* PA[6] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB6  ((uint32_t)0x00001900) /* PB[6] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA7  ((uint32_t)0x00001C00) /* PA[7] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB7  ((uint32_t)0x00001D00) /* PB[7] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA8  ((uint32_t)0x00002000) /* PA[8] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB8  ((uint32_t)0x00002100) /* PB[8] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA9  ((uint32_t)0x00002400) /* PA[9] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB9  ((uint32_t)0x00002500) /* PB[9] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA10 ((uint32_t)0x00002800) /* PA[10] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB10 ((uint32_t)0x00002900) /* PB[10] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA11 ((uint32_t)0x00002C00) /* PA[11] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB11 ((uint32_t)0x00002D00) /* PB[11] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA12 ((uint32_t)0x00003000) /* PA[12] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB12 ((uint32_t)0x00003100) /* PB[12] pin */
#define AFIO_EXTI_CFG4_EXTI13_PD12 ((uint32_t)0x00003300) /* PD[12] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA13 ((uint32_t)0x00003400) /* PA[13] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB13 ((uint32_t)0x00003500) /* PB[13] pin */
#define AFIO_EXTI_CFG4_EXTI13_PC13 ((uint32_t)0x00003600) /* PC[13] pin */
#define AFIO_EXTI_CFG4_EXTI13_PD13 ((uint32_t)0x00003700) /* PD[13] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA14 ((uint32_t)0x00003800) /* PA[14] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB14 ((uint32_t)0x00003900) /* PB[14] pin */
#define AFIO_EXTI_CFG4_EXTI13_PC14 ((uint32_t)0x00003A00) /* PC[14] pin */
#define AFIO_EXTI_CFG4_EXTI13_PD14 ((uint32_t)0x00003B00) /* PD[14] pin */
#define AFIO_EXTI_CFG4_EXTI13_PA15 ((uint32_t)0x00003C00) /* PA[15] pin */
#define AFIO_EXTI_CFG4_EXTI13_PB15 ((uint32_t)0x00003D00) /* PB[15] pin */
#define AFIO_EXTI_CFG4_EXTI13_PC15 ((uint32_t)0x00003E00) /* PC[15] pin */
#define AFIO_EXTI_CFG4_EXTI13_PD15 ((uint32_t)0x00003F00) /* PD[15] pin */

