SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** EXTI14 configuration **/
#define AFIO_EXTI_CFG4_EXTI14_PA0  ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB0  ((uint32_t)0x00010000) /* PB[0] pin */
#define AFIO_EXTI_CFG4_EXTI14_PD0  ((uint32_t)0x00030000) /* PD[0] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA1  ((uint32_t)0x00040000) /* PA[1] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB1  ((uint32_t)0x00050000) /* PB[1] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA2  ((uint32_t)0x00080000) /* PA[2] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB2  ((uint32_t)0x00090000) /* PB[2] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA3  ((uint32_t)0x000C0000) /* PA[3] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB3  ((uint32_t)0x000D0000) /* PB[3] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA4  ((uint32_t)0x00100000) /* PA[4] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB4  ((uint32_t)0x00110000) /* PB[4] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA5  ((uint32_t)0x00140000) /* PA[5] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB5  ((uint32_t)0x00150000) /* PB[5] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA6  ((uint32_t)0x00180000) /* PA[6] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB6  ((uint32_t)0x00190000) /* PB[6] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA7  ((uint32_t)0x001C0000) /* PA[7] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB7  ((uint32_t)0x001D0000) /* PB[7] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA8  ((uint32_t)0x00200000) /* PA[8] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB8  ((uint32_t)0x00210000) /* PB[8] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA9  ((uint32_t)0x00240000) /* PA[9] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB9  ((uint32_t)0x00250000) /* PB[9] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA10 ((uint32_t)0x00280000) /* PA[10] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB10 ((uint32_t)0x00290000) /* PB[10] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA11 ((uint32_t)0x002C0000) /* PA[11] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB11 ((uint32_t)0x002D0000) /* PB[11] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA12 ((uint32_t)0x00300000) /* PA[12] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB12 ((uint32_t)0x00310000) /* PB[12] pin */
#define AFIO_EXTI_CFG4_EXTI14_PD12 ((uint32_t)0x00330000) /* PD[12] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA13 ((uint32_t)0x00340000) /* PA[13] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB13 ((uint32_t)0x00350000) /* PB[13] pin */
#define AFIO_EXTI_CFG4_EXTI14_PC13 ((uint32_t)0x00360000) /* PC[13] pin */
#define AFIO_EXTI_CFG4_EXTI14_PD13 ((uint32_t)0x00370000) /* PD[13] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA14 ((uint32_t)0x00380000) /* PA[14] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB14 ((uint32_t)0x00390000) /* PB[14] pin */
#define AFIO_EXTI_CFG4_EXTI14_PC14 ((uint32_t)0x003A0000) /* PC[14] pin */
#define AFIO_EXTI_CFG4_EXTI14_PD14 ((uint32_t)0x003B0000) /* PD[14] pin */
#define AFIO_EXTI_CFG4_EXTI14_PA15 ((uint32_t)0x003C0000) /* PA[15] pin */
#define AFIO_EXTI_CFG4_EXTI14_PB15 ((uint32_t)0x003D0000) /* PB[15] pin */
#define AFIO_EXTI_CFG4_EXTI14_PC15 ((uint32_t)0x003E0000) /* PC[15] pin */
#define AFIO_EXTI_CFG4_EXTI14_PD15 ((uint32_t)0x003F0000) /* PD[15] pin */

/** EXTI15 configuration **/
#define AFIO_EXTI_CFG4_EXTI15_PA0  ((uint32_t)0x00000000) /* PA[0] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB0  ((uint32_t)0x01000000) /* PB[0] pin */
#define AFIO_EXTI_CFG4_EXTI15_PD0  ((uint32_t)0x03000000) /* PD[0] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA1  ((uint32_t)0x04000000) /* PA[1] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB1  ((uint32_t)0x05000000) /* PB[1] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA2  ((uint32_t)0x08000000) /* PA[2] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB2  ((uint32_t)0x09000000) /* PB[2] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA3  ((uint32_t)0x0C000000) /* PA[3] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB3  ((uint32_t)0x0D000000) /* PB[3] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA4  ((uint32_t)0x10000000) /* PA[4] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB4  ((uint32_t)0x11000000) /* PB[4] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA5  ((uint32_t)0x14000000) /* PA[5] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB5  ((uint32_t)0x15000000) /* PB[5] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA6  ((uint32_t)0x18000000) /* PA[6] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB6  ((uint32_t)0x19000000) /* PB[6] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA7  ((uint32_t)0x1C000000) /* PA[7] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB7  ((uint32_t)0x1D000000) /* PB[7] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA8  ((uint32_t)0x20000000) /* PA[8] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB8  ((uint32_t)0x21000000) /* PB[8] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA9  ((uint32_t)0x24000000) /* PA[9] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB9  ((uint32_t)0x25000000) /* PB[9] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA10 ((uint32_t)0x28000000) /* PA[10] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB10 ((uint32_t)0x29000000) /* PB[10] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA11 ((uint32_t)0x2C000000) /* PA[11] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB11 ((uint32_t)0x2D000000) /* PB[11] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA12 ((uint32_t)0x30000000) /* PA[12] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB12 ((uint32_t)0x31000000) /* PB[12] pin */
#define AFIO_EXTI_CFG4_EXTI15_PD12 ((uint32_t)0x33000000) /* PD[12] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA13 ((uint32_t)0x34000000) /* PA[13] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB13 ((uint32_t)0x35000000) /* PB[13] pin */
#define AFIO_EXTI_CFG4_EXTI15_PC13 ((uint32_t)0x36000000) /* PC[13] pin */
#define AFIO_EXTI_CFG4_EXTI15_PD13 ((uint32_t)0x37000000) /* PD[13] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA14 ((uint32_t)0x38000000) /* PA[14] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB14 ((uint32_t)0x39000000) /* PB[14] pin */
#define AFIO_EXTI_CFG4_EXTI15_PC14 ((uint32_t)0x3A000000) /* PC[14] pin */
#define AFIO_EXTI_CFG4_EXTI15_PD14 ((uint32_t)0x3B000000) /* PD[14] pin */
#define AFIO_EXTI_CFG4_EXTI15_PA15 ((uint32_t)0x3C000000) /* PA[15] pin */
#define AFIO_EXTI_CFG4_EXTI15_PB15 ((uint32_t)0x3D000000) /* PB[15] pin */
#define AFIO_EXTI_CFG4_EXTI15_PC15 ((uint32_t)0x3E000000) /* PC[15] pin */
#define AFIO_EXTI_CFG4_EXTI15_PD15 ((uint32_t)0x3F000000) /* PD[15] pin */

/** Bit definition for AFIO_5VTOL_CFG register **/
#define AFIO_5VTOL_CFG_PA0TOLENN   ((uint32_t)0x00000001)  /* PA[0]  5V tolerance */
#define AFIO_5VTOL_CFG_PA1TOLENN   ((uint32_t)0x00000002)  /* PA[1]  5V tolerance */
#define AFIO_5VTOL_CFG_PA2TOLENN   ((uint32_t)0x00000004)  /* PA[2]  5V tolerance */
#define AFIO_5VTOL_CFG_PA3TOLENN   ((uint32_t)0x00000008)  /* PA[3]  5V tolerance */
#define AFIO_5VTOL_CFG_PA4TOLENN   ((uint32_t)0x00000010)  /* PA[4]  5V tolerance */
#define AFIO_5VTOL_CFG_PA5TOLENN   ((uint32_t)0x00000020)  /* PA[5]  5V tolerance */
#define AFIO_5VTOL_CFG_PA6TOLENN   ((uint32_t)0x00000040)  /* PA[6]  5V tolerance */
#define AFIO_5VTOL_CFG_PA7TOLENN   ((uint32_t)0x00000080)  /* PA[7]  5V tolerance */
#define AFIO_5VTOL_CFG_PA8TOLENN   ((uint32_t)0x00000100)  /* PA[8]  5V tolerance */
#define AFIO_5VTOL_CFG_PA11TOLENN  ((uint32_t)0x00000200)  /* PA[11] 5V tolerance */
#define AFIO_5VTOL_CFG_PA12TOLENN  ((uint32_t)0x00000400)  /* PA[12] 5V tolerance */
#define AFIO_5VTOL_CFG_PA15TOLENN  ((uint32_t)0x00000800)  /* PA[15] 5V tolerance */
#define AFIO_5VTOL_CFG_PB0TOLENN   ((uint32_t)0x00001000)  /* PB[0]  5V tolerance */
#define AFIO_5VTOL_CFG_PB1TOLENN   ((uint32_t)0x00002000)  /* PB[1]  5V tolerance */
#define AFIO_5VTOL_CFG_PB2TOLENN   ((uint32_t)0x00004000)  /* PB[2]  5V tolerance */
#define AFIO_5VTOL_CFG_PB3TOLENN   ((uint32_t)0x00008000)  /* PB[3]  5V tolerance */
#define AFIO_5VTOL_CFG_PB4TOLENN   ((uint32_t)0x00010000)  /* PB[4]  5V tolerance */
#define AFIO_5VTOL_CFG_PB5TOLENN   ((uint32_t)0x00020000)  /* PB[5]  5V tolerance */
#define AFIO_5VTOL_CFG_PB7TOLENN   ((uint32_t)0x00040000)  /* PB[7]  5V tolerance */
#define AFIO_5VTOL_CFG_PB10TOLENN  ((uint32_t)0x00080000)  /* PB[10] 5V tolerance */
#define AFIO_5VTOL_CFG_PB11TOLENN  ((uint32_t)0x00100000)  /* PB[11] 5V tolerance */
#define AFIO_5VTOL_CFG_PB12TOLENN  ((uint32_t)0x00200000)  /* PB[12] 5V tolerance */
#define AFIO_5VTOL_CFG_PB13TOLENN  ((uint32_t)0x00400000)  /* PB[13] 5V tolerance */
#define AFIO_5VTOL_CFG_PB14TOLENN  ((uint32_t)0x00800000)  /* PB[14] 5V tolerance */
#define AFIO_5VTOL_CFG_PB15TOLENN  ((uint32_t)0x01000000)  /* PB[15] 5V tolerance */

