SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for AFIO_EFT_CFG1 register **/
#define AFIO_EFT_CFG1_PA0EFTEN     ((uint32_t)0x00000001) /* PA[0]  EFT IE */
#define AFIO_EFT_CFG1_PA1EFTEN     ((uint32_t)0x00000002) /* PA[1]  EFT IE */
#define AFIO_EFT_CFG1_PA2EFTEN     ((uint32_t)0x00000004) /* PA[2]  EFT IE */
#define AFIO_EFT_CFG1_PA3EFTEN     ((uint32_t)0x00000008) /* PA[3]  EFT IE */
#define AFIO_EFT_CFG1_PA4EFTEN     ((uint32_t)0x00000010) /* PA[4]  EFT IE */
#define AFIO_EFT_CFG1_PA5EFTEN     ((uint32_t)0x00000020) /* PA[5]  EFT IE */
#define AFIO_EFT_CFG1_PA6EFTEN     ((uint32_t)0x00000040) /* PA[6]  EFT IE */
#define AFIO_EFT_CFG1_PA7EFTEN     ((uint32_t)0x00000080) /* PA[7]  EFT IE */
#define AFIO_EFT_CFG1_PA8EFTEN     ((uint32_t)0x00000100) /* PA[8]  EFT IE */
#define AFIO_EFT_CFG1_PA9EFTEN     ((uint32_t)0x00000200) /* PA[9]  EFT IE */
#define AFIO_EFT_CFG1_PA10EFTEN    ((uint32_t)0x00000400) /* PA[10] EFT IE */
#define AFIO_EFT_CFG1_PA11EFTEN    ((uint32_t)0x00000800) /* PA[11] EFT IE */
#define AFIO_EFT_CFG1_PA12EFTEN    ((uint32_t)0x00001000) /* PA[12] EFT IE */
#define AFIO_EFT_CFG1_PA13EFTEN    ((uint32_t)0x00002000) /* PA[13] EFT IE */
#define AFIO_EFT_CFG1_PA14EFTEN    ((uint32_t)0x00004000) /* PA[14] EFT IE */
#define AFIO_EFT_CFG1_PA15EFTEN    ((uint32_t)0x00008000) /* PA[15] EFT IE */
#define AFIO_EFT_CFG1_PB0EFTEN     ((uint32_t)0x00010000) /* PB[0]  EFT IE */
#define AFIO_EFT_CFG1_PB1EFTEN     ((uint32_t)0x00020000) /* PB[1]  EFT IE */
#define AFIO_EFT_CFG1_PB2EFTEN     ((uint32_t)0x00040000) /* PB[2]  EFT IE */
#define AFIO_EFT_CFG1_PB3EFTEN     ((uint32_t)0x00080000) /* PB[3]  EFT IE */
#define AFIO_EFT_CFG1_PB4EFTEN     ((uint32_t)0x00100000) /* PB[4]  EFT IE */
#define AFIO_EFT_CFG1_PB5EFTEN     ((uint32_t)0x00200000) /* PB[5]  EFT IE */
#define AFIO_EFT_CFG1_PB6EFTEN     ((uint32_t)0x00400000) /* PB[6]  EFT IE */
#define AFIO_EFT_CFG1_PB7EFTEN     ((uint32_t)0x00800000) /* PB[7]  EFT IE */
#define AFIO_EFT_CFG1_PB8EFTEN     ((uint32_t)0x01000000) /* PB[8]  EFT IE */
#define AFIO_EFT_CFG1_PB9EFTEN     ((uint32_t)0x02000000) /* PB[9]  EFT IE */
#define AFIO_EFT_CFG1_PB10EFTEN    ((uint32_t)0x04000000) /* PB[10] EFT IE */
#define AFIO_EFT_CFG1_PB11EFTEN    ((uint32_t)0x08000000) /* PB[11] EFT IE */
#define AFIO_EFT_CFG1_PB12EFTEN    ((uint32_t)0x10000000) /* PB[12] EFT IE */
#define AFIO_EFT_CFG1_PB13EFTEN    ((uint32_t)0x20000000) /* PB[13] EFT IE */
#define AFIO_EFT_CFG1_PB14EFTEN    ((uint32_t)0x40000000) /* PB[14] EFT IE */
#define AFIO_EFT_CFG1_PB15EFTEN    ((uint32_t)0x80000000) /* PB[15] EFT IE */

/** Bit definition for AFIO_EFT_CFG2 register **/
#define AFIO_EFT_CFG2_PC13EFTEN    ((uint32_t)0x00002000) /* PC[13] EFT IE */
#define AFIO_EFT_CFG2_PC14EFTEN    ((uint32_t)0x00004000) /* PC[14] EFT IE */
#define AFIO_EFT_CFG2_PC15EFTEN    ((uint32_t)0x00008000) /* PC[15] EFT IE */
#define AFIO_EFT_CFG2_PD0EFTEN     ((uint32_t)0x00010000) /* PD[0]  EFT IE */
#define AFIO_EFT_CFG2_PD12EFTEN    ((uint32_t)0x10000000) /* PD[12] EFT IE */
#define AFIO_EFT_CFG2_PD13EFTEN    ((uint32_t)0x20000000) /* PD[13] EFT IE */
#define AFIO_EFT_CFG2_PD14EFTEN    ((uint32_t)0x40000000) /* PD[14] EFT IE */
#define AFIO_EFT_CFG2_PD15EFTEN    ((uint32_t)0x80000000) /* PD[15] EFT IE */

/** Bit definition for AFIO_FILT_CFG register **/
#define AFIO_FILT_CFG_IOFITCFG ((uint8_t)0x1F) /* Filter stage control */

/** Bit definition for AFIO_DIGEFT_CFG1 register **/
#define AFIO_DIGEFT_CFG1_PA0DIGEFTEN  ((uint32_t)0x00000001) /* PA[0]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA1DIGEFTEN  ((uint32_t)0x00000002) /* PA[1]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA2DIGEFTEN  ((uint32_t)0x00000004) /* PA[2]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA3DIGEFTEN  ((uint32_t)0x00000008) /* PA[3]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA4DIGEFTEN  ((uint32_t)0x00000010) /* PA[4]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA5DIGEFTEN  ((uint32_t)0x00000020) /* PA[5]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA6DIGEFTEN  ((uint32_t)0x00000040) /* PA[6]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA7DIGEFTEN  ((uint32_t)0x00000080) /* PA[7]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA8DIGEFTEN  ((uint32_t)0x00000100) /* PA[8]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA9DIGEFTEN  ((uint32_t)0x00000200) /* PA[9]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA10DIGEFTEN ((uint32_t)0x00000400) /* PA[10] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA11DIGEFTEN ((uint32_t)0x00000800) /* PA[11] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA12DIGEFTEN ((uint32_t)0x00001000) /* PA[12] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA13DIGEFTEN ((uint32_t)0x00002000) /* PA[13] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA14DIGEFTEN ((uint32_t)0x00004000) /* PA[14] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PA15DIGEFTEN ((uint32_t)0x00008000) /* PA[15] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB0DIGEFTEN  ((uint32_t)0x00010000) /* PB[0]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB1DIGEFTEN  ((uint32_t)0x00020000) /* PB[1]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB2DIGEFTEN  ((uint32_t)0x00040000) /* PB[2]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB3DIGEFTEN  ((uint32_t)0x00080000) /* PB[3]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB4DIGEFTEN  ((uint32_t)0x00100000) /* PB[4]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB5DIGEFTEN  ((uint32_t)0x00200000) /* PB[5]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB6DIGEFTEN  ((uint32_t)0x00400000) /* PB[6]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB7DIGEFTEN  ((uint32_t)0x00800000) /* PB[7]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB8DIGEFTEN  ((uint32_t)0x01000000) /* PB[8]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB9DIGEFTEN  ((uint32_t)0x02000000) /* PB[9]  DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB10DIGEFTEN ((uint32_t)0x04000000) /* PB[10] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB11DIGEFTEN ((uint32_t)0x08000000) /* PB[11] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB12DIGEFTEN ((uint32_t)0x10000000) /* PB[12] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB13DIGEFTEN ((uint32_t)0x20000000) /* PB[13] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB14DIGEFTEN ((uint32_t)0x40000000) /* PB[14] DIGEFT IE */
#define AFIO_DIGEFT_CFG1_PB15DIGEFTEN ((uint32_t)0x80000000) /* PB[15] DIGEFT IE */

