SoCXin/N32G430/src/firmware/CMSIS/device/n32g430.h
/** Bit definition for EXTI_PEND register **/
#define EXTI_PEND_PEND0  ((uint32_t)0x00000001) /* Pending bit for line 0 */
#define EXTI_PEND_PEND1  ((uint32_t)0x00000002) /* Pending bit for line 1 */
#define EXTI_PEND_PEND2  ((uint32_t)0x00000004) /* Pending bit for line 2 */
#define EXTI_PEND_PEND3  ((uint32_t)0x00000008) /* Pending bit for line 3 */
#define EXTI_PEND_PEND4  ((uint32_t)0x00000010) /* Pending bit for line 4 */
#define EXTI_PEND_PEND5  ((uint32_t)0x00000020) /* Pending bit for line 5 */
#define EXTI_PEND_PEND6  ((uint32_t)0x00000040) /* Pending bit for line 6 */
#define EXTI_PEND_PEND7  ((uint32_t)0x00000080) /* Pending bit for line 7 */
#define EXTI_PEND_PEND8  ((uint32_t)0x00000100) /* Pending bit for line 8 */
#define EXTI_PEND_PEND9  ((uint32_t)0x00000200) /* Pending bit for line 9 */
#define EXTI_PEND_PEND10 ((uint32_t)0x00000400) /* Pending bit for line 10 */
#define EXTI_PEND_PEND11 ((uint32_t)0x00000800) /* Pending bit for line 11 */
#define EXTI_PEND_PEND12 ((uint32_t)0x00001000) /* Pending bit for line 12 */
#define EXTI_PEND_PEND13 ((uint32_t)0x00002000) /* Pending bit for line 13 */
#define EXTI_PEND_PEND14 ((uint32_t)0x00004000) /* Pending bit for line 14 */
#define EXTI_PEND_PEND15 ((uint32_t)0x00008000) /* Pending bit for line 15 */
#define EXTI_PEND_PEND16 ((uint32_t)0x00010000) /* Pending bit for line 16 */
#define EXTI_PEND_PEND17 ((uint32_t)0x00020000) /* Pending bit for line 17 */
#define EXTI_PEND_PEND18 ((uint32_t)0x00040000) /* Pending bit for line 18 */
#define EXTI_PEND_PEND19 ((uint32_t)0x00080000) /* Pending bit for line 19 */
#define EXTI_PEND_PEND20 ((uint32_t)0x00100000) /* Pending bit for line 20 */
#define EXTI_PEND_PEND21 ((uint32_t)0x00200000) /* Pending bit for line 21 */
#define EXTI_PEND_PEND22 ((uint32_t)0x00400000) /* Pending bit for line 22 */
#define EXTI_PEND_PEND23 ((uint32_t)0x00800000) /* Pending bit for line 23 */
#define EXTI_PEND_PEND24 ((uint32_t)0x01000000) /* Pending bit for line 24 */
#define EXTI_PEND_PEND25 ((uint32_t)0x02000000) /* Pending bit for line 25 */
#define EXTI_PEND_PEND26 ((uint32_t)0x04000000) /* Pending bit for line 26 */

/** Bit Offset register **/
#define REG_BIT1_OFFSET    ((uint32_t)0x00000001)
#define REG_BIT2_OFFSET    ((uint32_t)0x00000002)
#define REG_BIT3_OFFSET    ((uint32_t)0x00000003)
#define REG_BIT4_OFFSET    ((uint32_t)0x00000004)
#define REG_BIT5_OFFSET    ((uint32_t)0x00000005)
#define REG_BIT6_OFFSET    ((uint32_t)0x00000006)
#define REG_BIT7_OFFSET    ((uint32_t)0x00000007)
#define REG_BIT8_OFFSET    ((uint32_t)0x00000008)
#define REG_BIT9_OFFSET    ((uint32_t)0x00000009)
#define REG_BIT10_OFFSET   ((uint32_t)0x0000000A)
#define REG_BIT11_OFFSET   ((uint32_t)0x0000000B)
#define REG_BIT12_OFFSET   ((uint32_t)0x0000000C)
#define REG_BIT13_OFFSET   ((uint32_t)0x0000000D)
#define REG_BIT14_OFFSET   ((uint32_t)0x0000000E)
#define REG_BIT15_OFFSET   ((uint32_t)0x0000000F)
#define REG_BIT16_OFFSET   ((uint32_t)0x00000010)
#define REG_BIT17_OFFSET   ((uint32_t)0x00000011)
#define REG_BIT18_OFFSET   ((uint32_t)0x00000012)
#define REG_BIT19_OFFSET   ((uint32_t)0x00000013)
#define REG_BIT20_OFFSET   ((uint32_t)0x00000014)
#define REG_BIT21_OFFSET   ((uint32_t)0x00000015)
#define REG_BIT22_OFFSET   ((uint32_t)0x00000016)
#define REG_BIT23_OFFSET   ((uint32_t)0x00000017)
#define REG_BIT24_OFFSET   ((uint32_t)0x00000018)
#define REG_BIT25_OFFSET   ((uint32_t)0x00000019)
#define REG_BIT26_OFFSET   ((uint32_t)0x0000001A)
#define REG_BIT27_OFFSET   ((uint32_t)0x0000001B)
#define REG_BIT28_OFFSET   ((uint32_t)0x0000001C)
#define REG_BIT29_OFFSET   ((uint32_t)0x0000001D)
#define REG_BIT30_OFFSET   ((uint32_t)0x0000001E)
#define REG_BIT31_OFFSET   ((uint32_t)0x0000001F)
#define REG_BIT32_OFFSET   ((uint32_t)0x00000020)

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

/**
 * @}
 */

#ifdef USE_STDPERIPH_DRIVER
#include "n32g430_conf.h"
#endif

#ifdef __cplusplus
}
#endif

#endif /* __N32G430_H__ */
